{
  "metadata": {
    "title": "OpenEdge 12.2.15.00 ABL Functions Reference",
    "description": "Complete reference of all ABL built-in functions for OpenEdge 12.2.15.00",
    "version": "12.2.15.00",
    "totalFunctions": 228
  },
  "functions": [
    {
      "name": "ABSOLUTE",
      "description": "Returns the absolute value of a numeric value.",
      "parameters": [
        {
          "name": "n",
          "type": "INTEGER",
          "description": "An integer or decimal expression. The return value is the same format as n.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "ACCUM",
      "description": "Returns the value of an aggregate expression that is calculated by an ACCUMULATE or aggregate phrase of a DISPLAY statement.",
      "parameters": [
        {
          "name": "aggregate-phrase",
          "type": "CHARACTER",
          "description": "A phrase that identifies the aggregate value it should return. This is the syntax for aggregate-phrase: { AVERAGE | COUNT | MAXIMUM | MINIMUM | TOTAL | SUB-AVERAGE | SUB-COUNT | SUB-MAXIMUM | SUB-MINIMUM | SUB-TOTAL } [ BY break-group] For more information on aggregate items, see the Aggregate phrase reference entry.",
          "optional": false
        },
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression that was used in an earlier ACCUMULATE or DISPLAY statement. The expression you use in the ACCUMULATE or DISPLAY statement and the expression you use in the ACCUM function must be in exactly the same form. (For example, \"on-hand * cost\" and \"cost * on-hand\" are not in exactly the same form.) For the AVERAGE, SUB-AVERAGE, TOTAL, and SUB-TOTAL aggregate phrases, expression must be numeric.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "ADD-INTERVAL",
      "description": "Adds a time interval to, or subtracts a time interval from, a DATE, DATETIME, or DATETIME-TZ value, and returns the new value.",
      "parameters": [
        {
          "name": "datetime",
          "type": "DATE",
          "description": "An expression whose value is a DATE, DATETIME, or DATETIME-TZ.",
          "optional": false
        },
        {
          "name": "interval-amount",
          "type": "INTEGER",
          "description": "A signed integer (positive or negative) indicating the amount of time you want to add to or subtract from datetime value.",
          "optional": false
        },
        {
          "name": "interval-unit",
          "type": "CHARACTER",
          "description": "A character constant, or a character expression that evaluates to one of the following time units: ‘years', ‘months', ‘weeks', ‘days', 'hours', ‘minutes', ‘seconds' or ‘milliseconds'. These values are case insensitive and may be singular.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "ALIAS",
      "description": "The ALIAS function returns the alias corresponding to the integer value of expression.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "If there are, for example, three currently defined aliases, the functions ALIAS(1), ALIAS(2), and ALIAS(3) return them. If the ALIAS function cannot find a defined alias, it returns the Unknown value (?). For example, building on the previous example of three defined aliases, the functions ALIAS(4), ALIAS(5), and ALIAS(6) return the Unknown value (?) because they cannot find a defined alias.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "AMBIGUOUS",
      "description": "Returns a TRUE value if the last FIND statement for a particular record found more than one record that met the specified index criteria.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of a record or record buffer used in a previous FIND statement. To access a record in a table defined for multiple databases, you might have to qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "ASC",
      "description": "Converts a character expression representing a single character into the corresponding ASCII (or internal code page) value, returned as an INTEGER.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression with a value of a single character that you want to convert to an ASCII (or internal code page) integer value. If expression is a constant, you must enclose it in quotation marks (\" \"). If the value of expression is other than a single character, ASC returns the value -1.The values for expression are case sensitive. For example, ASC(\"a\") returns a different value than ASC(\"A\").",
          "optional": false
        },
        {
          "name": "target-codepage",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a code page. The name that you specify must be a valid code page name available in the OpenEdge-install-dir/convmap.cp file (a binary file that contains all of the tables that ABL uses for character management). If you supply a non-valid name, the ASC function returns the value -1 and returns a runtime error. Before returning an integer value, the ASC function converts expression from source-codepage to target-codepage. The returned integer value is relative to target-codepage. If you do not specify target-codepage, the value returned is the code page identified with the Internal Code Page (-cpinternal) parameter.",
          "optional": false
        },
        {
          "name": "source-codepage",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a code page. The name that you specify must be a valid code page name available in the OpenEdge-install-dir/convmap.cp file. If you supply a non-valid name, the ASC function returns the value -1. The source-codepage specifies the name of the code page to which expression is relative. The default value of source-codepage is the code page identified with the Internal Code Page (-cpinternal) parameter.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "AUDIT-ENABLED",
      "description": "Determines whether a connected database is audit-enabled.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a connected database to query. For example, AUDIT-ENABLED(1) queries the first database, AUDIT-ENABLED(2) queries the second database, and so on. If you specify a sequence number that does not correspond to a connected database, the AVM returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "The logical name or alias of a connected database to query. These forms require a quoted character string or a character expression. If you specify a logical name or alias that does not correspond to a connected database, the AVM returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "AVAILABLE",
      "description": "Returns a TRUE value if the record buffer you name contains a record and returns a FALSE value if the record buffer is empty.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of the record buffer you want to check. Note: To access a record in a table defined for multiple databases, you might have to qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "BASE64-DECODE",
      "description": "Converts a Base64 character string into a binary value. The result is a MEMPTR containing the binary data.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression containing the string you want to convert.",
          "optional": false
        }
      ],
      "returnType": "MEMPTR"
    },
    {
      "name": "BASE64-ENCODE",
      "description": "Converts binary data into a Base64 character string, and returns a LONGCHAR containing the character data. The resulting LONGCHAR is in the code page specified by -cpinternal.",
      "parameters": [
        {
          "name": "expression",
          "type": "MEMPTR",
          "description": "A MEMPTR or RAW expression containing the binary data you want to convert.",
          "optional": false
        }
      ],
      "returnType": "LONGCHAR"
    },
    {
      "name": "BOX",
      "description": "(Windows only; GUI for .NET only)",
      "parameters": [
        {
          "name": "ABL-expression",
          "type": "CHARACTER",
          "description": "Specifies an expression with a value in one of the following .NET-compatible ABL data types: CHARACTER DATE DATETIME DATETIME-TZ DECIMAL INT64 INTEGER LOGICAL LONGCHAR A .NET-compatible ABL array A .NET-compatible ABL array is an ABL array of one of the listed ABL primitive types or an ABL array of any supported .NET object type (a .NET object type not mapped as specified in Table 4 ).",
          "optional": false
        }
      ],
      "returnType": "SYSTEM.OBJECT"
    },
    {
      "name": "BUFFER-GROUP-ID",
      "description": "Returns the group ID (as an integer) of the tenant group to which the current record in a specified record buffer belongs. If the buffer does not contain a record from a tenant group, the function returns the Unknown value (?).",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a record buffer.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "BUFFER-GROUP-NAME",
      "description": "Returns the name (as a character string) of the tenant group to which the current record in a specified record buffer belongs. If the buffer does not contain a record from a tenant group, the function returns the Unknown value (?).",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a record buffer.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "BUFFER-PARTITION-ID",
      "description": "Returns the partition ID (as an integer) of the partition of the current record in a specified buffer.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a record buffer. If the buffer is not populated with a record, this function returns the Unknown value (?). If there is a record in the buffer but it is not for a partitioned table, this function returns zero (0).",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "BUFFER-TENANT-ID",
      "description": "Returns the tenant ID (as an integer) of the tenant that owns the current record in a specified buffer.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a record buffer. If the buffer is not populated with a record, this function returns the Unknown value (?). If the buffer is for a shared table, a temp-table, or for the default tenant of a multi-tenant table, the function returns the value zero (0). If the buffer contains a record for a tenant group and the user is a super tenant, the function returns the tenant ID of one of the members of the group. The tenant ID returned is indeterminate, but is always the tenant ID of a tenant in the group. For a regular tenant, the record in the buffer always belongs to that tenant. So, the function always returns the user's own tenant ID. This is true even if the record belongs to a tenant group.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "BUFFER-TENANT-NAME",
      "description": "Returns the name (as a character string) of the tenant that owns the current record in a specified buffer.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a record buffer. If the buffer is not populated with a record, this function returns the Unknown value (?). If the buffer is for a shared table or a temp-table, the function returns the empty string (\"\"). If the buffer contains a record that belongs to a tenant group and the user is a super tenant, the function returns the tenant name of one of the members of the group. The tenant name returned is indeterminate, but is always the name of a tenant in the group. For a regular tenant user, the record in the buffer always belongs to that tenant. So, the function always returns the user's own tenant name. This is true even if the record belongs to a tenant group.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "CAN-DO",
      "description": "Checks a user ID against a list of one or more user ID matching patterns that can be used to indicate what users have access to a given application function. The function returns TRUE if the specified user ID has access according to the list. Thus, you can implement run-time authorization checking for any procedure or class in your application.",
      "parameters": [
        {
          "name": "id-pattern-list",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that evaluates to a list of one or more user ID patterns. Each user ID pattern must be in the form of a table and field permission string that you might specify when editing data security with database administration tools. If the expression contains multiple user ID patterns, you must separate the patterns with commas. There can be no embedded spaces within or between the patterns in the list.The following table lists some basic user ID patterns that you can include in id-pattern-list, where user-ID can be a fully qualified or non-qualified user ID, depending on your application and authentication design, and string is a sequence of characters from any user ID. For more information on fully qualified and non-qualified user ID's, see the reference entries for the QUALIFIED-USER-ID attribute, USER-ID attribute, and USERID function. The patterns shown also support the use of a period (.) as a wildcard for a single character matches. For example, CAN-DO(\"a.c\",\"abc\") evaluates to TRUE. Basic patterns to use in user ID pattern lists Value Meaning * All users have access. user-ID This user has access. !user-ID This user does not have access. string* Users whose IDs begin with string have access. !string* Users whose IDs begin with string do not have access. You can use any combination of patterns to define id-pattern-list. These patterns are fully consistent with the permissions that you can define for OpenEdge database tables and fields using database administration tools. The following table shows some examples of fully qualified user ID matches. Fully qualified user ID matches This pattern... Matches... The blank user name in the blank domain * All user ID's mark@acme.com The \"mark\" user name in the \"acme.com\" domain mark The \"mark\" user name in the blank domain mark* All user names that begin with \"mark\" in the blank domain *jones All user names that end with \"jones\" in the blank domain db*user All user names that begin with \"db\" and end with \"user\" in the blank domain @acme The blank user name in the \"acme\" domain *@acme All user names in the \"acme\" domain @ The blank user name in the blank domain mark@* The \"mark\" user name in any domain *@* Any user name in any domain mark*@acme.* Any user name that begins with \"mark\" in any domain that begins with \"acme.\" *@*.admins Any user name in any domain that ends with \".admins\" Note: For a more complete description of the possible patterns and their meanings, see Introduction to Identity Management and the Database Administration online help.",
          "optional": false
        },
        {
          "name": "userid",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a user ID value that can be returned from the QUALIFIED-USER-ID attribute, USER-ID attribute, or USERID function. The userid is checked against id-pattern-list. If you do not enter userid, the compiler inserts the USERID function by default, which is evaluated each time you run the procedure or class. If the compiler inserts the USERID function, the function does not reference a database name and therefore only works for an ABL session with one database connection. If you explicitly use the USERID function and have more than one database connected, be sure to include the database name with the function call, for example, USERID(\"Sports2020\").",
          "optional": true
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "CAN-FIND",
      "description": "Returns a TRUE value if a record is found that meets the specified FIND criteria; otherwise it returns FALSE. CAN-FIND does not make the record available to the procedure. You typically use the CAN-FIND function within a VALIDATE option in a data handling statement, such as the UPDATE statement.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The record buffer you are checking for existence.To use CAN-FIND to locate a record in a table defined for multiple databases, you might have to qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        },
        {
          "name": "constant",
          "type": "CHARACTER",
          "description": "The table you want to use has a primary index; the constant is the value of the last component field of that index for the record you want.",
          "optional": true
        },
        {
          "name": "table",
          "type": "LOGICAL",
          "description": "Qualifies the records to use by relating the record to a record in another table.",
          "optional": false
        },
        {
          "name": "expression",
          "type": "LOGICAL",
          "description": "Qualifies the record that CAN-FIND searches for. The expression must return a TRUE or FALSE value.",
          "optional": false
        },
        {
          "name": "index",
          "type": "CHARACTER",
          "description": "Identifies the index you want CAN-FIND to use to find a record. If you do not use this argument, the AVM selects an index to use based on the criteria specified with the WHERE, USING, OF, or constant arguments.",
          "optional": false
        },
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "One or more names of fields you want to use to search for a record. The field you name in this argument must have been previously entered into a screen field, usually with a PROMPT-FOR statement. The field must be viewed as a fill-in or text widget.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "CAN-QUERY",
      "description": "Returns a logical value indicating whether you can query a specified attribute or method for a specified widget.",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "An expression that evaluates to a handle. The handle must refer to a valid widget.",
          "optional": false
        },
        {
          "name": "attribute-name",
          "type": "CHARACTER",
          "description": "An expression that evaluates to a character-string value. The contents of the string must be an attribute or method name. For more information on attributes, see the Handle Attributes and Methods Reference.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "CAN-SET",
      "description": "Returns a logical value indicating whether you can set a specified attribute for a specified widget.",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "An expression that evaluates to a handle. The handle must refer to a valid widget.",
          "optional": false
        },
        {
          "name": "attribute-name",
          "type": "CHARACTER",
          "description": "An expression that evaluates to a character-string value. The contents of the string must be an attribute name. For more information on attributes, see the Handle Attributes and Methods Reference.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "CAPS",
      "description": "Converts any lowercase characters in a CHARACTER or LONGCHAR expression to uppercase characters, and returns the result. The data type of the returned value matches the data type of the expression passed to the function.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that results in a CHARACTER or LONGCHAR value.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "CAST",
      "description": "Returns a new object reference to the same class instance as an existing object reference, but with a different data type. This different data type is cast from the object type of the original object reference according to another specified object type. The two object types must be related, where one is a class type and the other is a subclass of that class type or where one is an interface type and the other is a class that implements the interface of that type.",
      "parameters": [
        {
          "name": "object-reference",
          "type": "CHARACTER",
          "description": "An object reference defined with the object type to be cast.",
          "optional": false
        },
        {
          "name": "object-type-name",
          "type": "CHARACTER",
          "description": "Specifies the type name of an ABL or .NET class or interface type to which the object reference is cast. This object type must be a class type in a class hierarchy that includes or implements the object-reference data type or it must be an interface type that the object-reference data type implements. Specify the object type name using the syntax described in the Type-name syntax reference entry. With an appropriate USING statement, you can also specify an unqualified class or interface name alone.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "CHR",
      "description": "Converts an integer value to its corresponding character value.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression that yields an integer value that you want to convert to a character value.If the value of expression is in the range of 1 to 255, CHR returns a single character. This character might not be printable or might not display on certain terminals. For a value greater than 255, the CHR function checks whether the value represents a valid character within the source code page. For a double-byte or Unicode source code page, it checks for a corresponding lead-byte value. If the integer value corresponds to a valid lead-byte and the value represents a valid character in the source code page, CHR returns the character. Otherwise, the character returns a null string.",
          "optional": false
        },
        {
          "name": "target-codepage",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a code page. The name that you specify must be a valid code page name available in the DLC/convmap.cp file (a binary file that contains all of the tables that ABL uses for character management). If you supply a non-valid name, the CHR function returns a null string. Before returning a character value, the CHR function converts expression from source-codepage to target-codepage. The returned character value is relative to target-codepage. If you do not specify target-codepage, no code page conversions occur.",
          "optional": false
        },
        {
          "name": "source-codepage",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a code page. The name that you specify must be a valid code page name available in the DLC/convmap.cp file. If you supply a non-valid name, the CHR function returns a null string. The source-codepage specifies the name of the code page to which expression is relative. The default value of source-codepage is the value of SESSION:CHARSET.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "CODEPAGE-CONVERT",
      "description": "Converts a string value from one code page to another.",
      "parameters": [
        {
          "name": "source-string",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression to be converted.",
          "optional": false
        },
        {
          "name": "target-codepage",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a code page. The returned character value is relative to target-codepage. The name that you specify must be a valid code page name available in the DLC/convmap.cp file (a binary file that contains all of the tables that ABL uses for character management). If you supply a non-valid name, the CODEPAGE-CONVERT function returns the Unknown value (?). Before returning a character value, the CODEPAGE-CONVERT function converts source-string from source-codepage to target-codepage. If you do not specify target-codepage, no code page conversions occur.",
          "optional": false
        },
        {
          "name": "source-codepage",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a code page. The source-codepage specifies the name of the code page to which source-string is relative. The name that you specify must be a valid code page name available in the DLC/convmap.cp file. If you supply a non-valid name, the CODEPAGE-CONVERT function returns the Unknown value (?). The default value of source-codepage is the value of CHARSET attribute of the SESSION handle.If source-string is a LONGCHAR variable, the source-codepage argument is not valid. In this case, the code page of the LONGCHAR variable is used as the source code page.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "COMPARE",
      "description": "The COMPARE function compares two strings and lets you:",
      "parameters": [
        {
          "name": "string1",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression that evaluates to the first string to be compared.",
          "optional": false
        },
        {
          "name": "relational-operator",
          "type": "CHARACTER",
          "description": "A CHARACTER expression that evaluates to one of the relational operators, which are: LT (or <), LE (or <=), EQ (or =), GE (or >=), GT (or >), NE (or <>), \"BEGINS\", and \"MATCHES\".",
          "optional": false
        },
        {
          "name": "string2",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression that evaluates to the second string to be compared.",
          "optional": false
        },
        {
          "name": "strength",
          "type": "CHARACTER",
          "description": "A CHARACTER expression that evaluates to the ABL comparison strength or the International Components for Unicode (ICU) comparison strength to apply. The ABL comparison strengths include: RAW — The AVM compares the two strings using the numeric values in the current code page. CASE-SENSITIVE — The AVM performs a case-sensitive comparison of the two strings using the numeric values in either the collation table specified in collation, or the collation table of the client. If you specify this strength with an ICU collation, the AVM applies the ICU TERTIARY strength. CASE-INSENSITIVE — The AVM performs a case-insensitive comparison of the two strings using the numeric values in either the collation table specified in collation, or the collation table of the client. If you specify this strength with an ICU collation, the AVM applies the ICU SECONDARY strength. CAPS — The AVM converts any lowercase letters in the two strings to uppercase letters, based on the settings of the Internal Code Page (-cpinternal) and Case Table (-cpcase) startup parameters, and then performs a raw comparison of the resulting strings. When neither string contains a wildcard character, this option behaves the same as the MATCHES operator. The ICU comparison strengths include: PRIMARY — The AVM compares the base characters in the two strings. SECONDARY — The AVM compares the base characters and any diacritical marks in the two strings. TERTIARY — The AVM performs a case-sensitive comparison of the base characters and diacritical marks in the two strings. QUATERNARY — The AVM performs a case-sensitive comparison of the base characters and any diacritical marks in the two strings, and distinguishes words with and without punctuation. ICU uses this strength to distinguish between Hiragana and Katakana when applied with the ICU-JA (Japanese) collation. Otherwise, it is the same as TERTIARY. Note: Use ICU comparison strengths only with ICU collations.",
          "optional": false
        },
        {
          "name": "collation",
          "type": "CHARACTER",
          "description": "A CHARACTER expression that evaluates to the name of an ABL collation table or ICU collation. By default, the AVM uses the collation rules you specify to compare characters and sort records. The collation rules specified with the Collation Table (-cpcoll) startup parameter take precedence over a collation specified for any database the AVM accesses during the session, except when the AVM uses or modifies pre-existing indexes. If you do not specify a collation with the -cpcoll startup parameter, the AVM uses the language collation rules defined for the first database on the command line. If you do not specify a database on the command line, the AVM uses the collation rules with the default name \"basic\" (which might or might not exist in the convmap.cp file).If strength is not RAW or CAPS, the collation must be either an ABL collation table in the convmap.cp file or an ICU collation, and must be a valid collation table for the code page corresponding to the -cpinternal startup parameter.",
          "optional": true
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "CONNECTED",
      "description": "Tells whether a database is connected. If logical name is the logical name or alias is the alias of a connected database, the CONNECTED function returns TRUE; otherwise, it returns FALSE.",
      "parameters": [
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "Refers to a logical name. It can be a quoted string or a character expression. An unquoted character string is not allowed.",
          "optional": false
        },
        {
          "name": "alias",
          "type": "CHARACTER",
          "description": "Refers to an alias. It can be a quoted string or a character expression. An unquoted character string is not allowed.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "COUNT-OF",
      "description": "Returns an INTEGER value that is the total number of selected records in the file or files you are using across break groups.",
      "parameters": [
        {
          "name": "break-group",
          "type": "CHARACTER",
          "description": "The name of a field or expression you named in the block header with the BREAK BY option.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "CURRENT-CHANGED",
      "description": "Returns TRUE if the copy of the record in the buffer after executing a FIND CURRENT or GET CURRENT differs from the copy of the record in the buffer before executing the FIND CURRENT or GET CURRENT. That is, if the current application changes the record, but no other user changes the record during its scope in the current application, CURRENT-CHANGED returns FALSE.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of a table or buffer.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "CURRENT-LANGUAGE",
      "description": "Returns the current value of the CURRENT-LANGUAGE variable.",
      "returnType": "DECIMAL"
    },
    {
      "name": "CURRENT-RESULT-ROW",
      "description": "Returns the number of the current row of a specified query as an INTEGER value.",
      "parameters": [
        {
          "name": "query-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a currently open, scrolling query. If query-name does not resolve to the name of a query, or if the query is not open or not scrolling, then the function returns the Unknown value (?).Note: Searching for a query using a handle is more efficient than a character expression. The AVM resolves a character expression at run time by searching in the current routine for a static query with that name. If not found, the AVM searches the enclosing main procedure. If still not found, the AVM searches up through the calling programs of the current routine and their main procedures. Since a handle uniquely identifies a query, no such search is required.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "CURRENT-VALUE",
      "description": "Returns the current INT64 value of a sequence defined in the Data Dictionary.",
      "parameters": [
        {
          "name": "sequence",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a sequence defined in the Data Dictionary.",
          "optional": false
        },
        {
          "name": "logical-dbname",
          "type": "CHARACTER",
          "description": "An identifier that specifies the logical name of the database in which the sequence is defined. The database must be connected. You can omit this parameter if the sequence name is unambiguous. If a sequence with this name exists in more than one connected database, then you must specify logical-dbname.",
          "optional": true
        },
        {
          "name": "tenant-id",
          "type": "INTEGER",
          "description": "An integer expression that evaluates to the tenant ID of a regular tenant, including the default tenant (0). This option applies only to a multi-tenant sequence specified by sequence and is intended for access primarily by a super-tenant user. If you are a regular-tenant user and you specify tenant-id, the specified tenant must be the same as the tenant associated with the database connection identity for logical-dbname or the AVM raises a run-time error. If you are a super-tenant user and you do not specify tenant-id, the function assumes the effective tenant ID (GET-EFFECTIVE-TENANT-ID function). If the sequence specified by sequence is non-multi-tenant (a shared sequence in a multi-tenant database), and you specify tenant-id, the option is ignored.",
          "optional": true
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "DATASERVERS",
      "description": "Returns a list of database types your OpenEdge product supports from where it is executed. The DATASERVERS function takes no arguments.",
      "returnType": "CHARACTER"
    },
    {
      "name": "DATA-SOURCE-MODIFIED",
      "description": "Returns TRUE if data in the data source associated with the specified ProDataSet temp-table buffer has been modified.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "The name of a ProDataSet temp-table buffer.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "DATE",
      "description": "Converts a single character string, a set of month, day, and year values, an integer expression, a DATETIME expression, or a DATETIME-TZ expression into a DATE value.",
      "parameters": [
        {
          "name": "month",
          "type": "INTEGER",
          "description": "A constant, field name, variable name, or expression whose value is an integer from 1 to 12, inclusive.",
          "optional": false
        },
        {
          "name": "day",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 1 to the highest valid day of the month.",
          "optional": false
        },
        {
          "name": "year",
          "type": "CHARACTER",
          "description": "An expression whose value is the year (for example, 1994).",
          "optional": false
        },
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "A character string containing a date value to convert into a DATE data type. The string value must have the format specified by the Date Format (-d) startup parameter (the default is mdy). Note that -d sets the display format, not the date storage format, which is fixed. Furthermore, date constants entered in procedures, or as initial values in the Data Dictionary, are always specified in month/day/year format. You do not have to specify separator characters for the month, day, and year components of the date string; however, slashes(/), periods(.), and hyphens(-) are accepted as separator characters.",
          "optional": false
        }
      ],
      "returnType": "DATE"
    },
    {
      "name": "DATETIME",
      "description": "Converts date and time values, or a character string, into a DATETIME value.",
      "parameters": [
        {
          "name": "date-exp",
          "type": "DATE",
          "description": "An expression whose value is a DATE.",
          "optional": false
        },
        {
          "name": "mtime-exp",
          "type": "INTEGER",
          "description": "An expression whose value is an integer representing the number of milliseconds since midnight.",
          "optional": true
        },
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "A character expression whose value is a string containing a DATETIME. The date portion of the string must have the format specified by the DATE-FORMAT attribute. The time portion must be in a valid time format (HH:MM:SS, and so on).",
          "optional": false
        },
        {
          "name": "month",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 1 to 12, inclusive.",
          "optional": false
        },
        {
          "name": "day",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 1 to the highest valid day of the month.",
          "optional": false
        },
        {
          "name": "year",
          "type": "INTEGER",
          "description": "An expression that evaluates to a year.",
          "optional": false
        },
        {
          "name": "hours",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 23, inclusive.",
          "optional": false
        },
        {
          "name": "minutes",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 59, inclusive.",
          "optional": false
        },
        {
          "name": "seconds",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 61, inclusive. The upper limit is 61 for leap seconds.",
          "optional": false
        },
        {
          "name": "milliseconds",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 999, inclusive.",
          "optional": false
        }
      ],
      "returnType": "DATETIME"
    },
    {
      "name": "DATETIME-TZ",
      "description": "Converts a date, time, and time zone value, or a character string, into a DATETIME-TZ value.",
      "parameters": [
        {
          "name": "date-exp",
          "type": "DATE",
          "description": "An expression whose value is a DATE.",
          "optional": false
        },
        {
          "name": "mtime-exp",
          "type": "INTEGER",
          "description": "An expression whose value is an integer representing the number of milliseconds since midnight.",
          "optional": false
        },
        {
          "name": "timezone-exp",
          "type": "INTEGER",
          "description": "An expression whose value is an integer representing the time zone offset from Coordinated Universal Time (UTC) in minutes. If not specified, the function uses the session's time zone.",
          "optional": true
        },
        {
          "name": "datetime-exp",
          "type": "DATE",
          "description": "An expression whose value is a DATETIME.",
          "optional": false
        },
        {
          "name": "datetime-tz-exp",
          "type": "DATE",
          "description": "An expression whose value is a DATETIME-TZ. Use this option to convert a DATETIME-TZ from one time zone to another.",
          "optional": false
        },
        {
          "name": "month",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 1 to 12, inclusive.",
          "optional": false
        },
        {
          "name": "day",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 1 to the highest valid day of the month.",
          "optional": false
        },
        {
          "name": "year",
          "type": "INTEGER",
          "description": "An expression that evaluates to a year.",
          "optional": false
        },
        {
          "name": "hours",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 23, inclusive.",
          "optional": false
        },
        {
          "name": "minutes",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 59, inclusive.",
          "optional": false
        },
        {
          "name": "seconds",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 61, inclusive. The upper limit is 61 for leap seconds.",
          "optional": false
        },
        {
          "name": "milliseconds",
          "type": "INTEGER",
          "description": "An expression whose value is an integer from 0 to 999, inclusive.",
          "optional": false
        },
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "A character expression whose value is a string containing a DATETIME-TZ. The date portion of the string must have the format specified by the DATE-FORMAT attribute. The time portion must be in a valid time format (HH:MM:SS, and so on). If the string contains a time zone, it must be in +HH:MM format. If the string does not contain a time zone, the DATETIME-TZ inherits the session's time zone.",
          "optional": false
        }
      ],
      "returnType": "DATETIME"
    },
    {
      "name": "DAY",
      "description": "Evaluates a date expression and returns a day of the month as an INTEGER value from 1 to 31, inclusive.",
      "parameters": [
        {
          "name": "date",
          "type": "DATE",
          "description": "An expression whose value is a DATE.",
          "optional": false
        },
        {
          "name": "datetime-expression",
          "type": "DATE",
          "description": "An expression that evaluates to a DATETIME or DATETIME-TZ. The DAY function returns the day of the month of the date part of the DATETIME or DATETIME-TZ value.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "DBCODEPAGE",
      "description": "Returns, as a character string, the name of a connected database's code page.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBCODEPAGE(1) returns information on the first database the ABL session is connected to, DCODEPAGE(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBCODEPAGE function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "A character expression that specifies the database by its logical name or alias.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DBCOLLATION",
      "description": "Returns, as a character string, the name of the collating sequence for character set information contained in the database. This name corresponds to the definition of the collating sequence contained in the convmap.dat file, which usually resides in the $DLC directory. If any parameter is invalid, DBCOLLATION returns the Unknown value (?).",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBCOLLATION(1) returns information on the first database the ABL session is connected to, DBCOLLATION(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBCOLLATION function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "A character expression that specifies the database by its logical name or alias.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DBNAME",
      "description": "Returns, as a character string, the name of the logical database currently in use or the name of your first connected database.",
      "returnType": "CHARACTER"
    },
    {
      "name": "DBPARAM",
      "description": "Returns, as a character string, a comma-separated list of the parameters used to connect to the database.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBPARAM(1) returns information on the first database the ABL session is connected to, DBPARAM(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBPARAM function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "These forms of the DBPARAM function require a character expression as a parameter. An unquoted character string is not permitted. If the parameter is an alias or the logical name of a connected database, then the AVM returns the comma-separated parameter list. Otherwise, it returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DB-REMOTE-HOST",
      "description": "Returns a character string containing the IP address of the database connection. The IP address format is determined by the Internet Protocol used when the connection was established. A single input parameter identifies the database, which can be either the logical database name or database number. If the database is not connected using TCP/IP or the -ipver IPv6 startup parameter is not used, the function returns the Unknown value (?).",
      "parameters": [
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "A character expression specifying the logical name of a connected database.",
          "optional": false
        },
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a connected database. For example, DB-REMOTE-HOST(1) returns information on the first connected database, DB-REMOTE-HOST(2) returns information on the second connected database, and so on.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DBRESTRICTIONS",
      "description": "Returns a character string that describes features that are not supported for this database. You can use this function with OpenEdge DataServers.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBRESTRICTIONS(1) returns information on the first database the ABL session is connected to, DBRESTRICTIONS(2) returns information on the second database the ABL session is connected to, and so on. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBRESTRICTIONS function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "These forms of the DBRESTRICTIONS function require a character expression as a parameter. An unquoted character string is not permitted. If the parameter is an alias or the logical name of a connected database, then the AVM returns the database restrictions string. Otherwise, it returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "table-name",
          "type": "CHARACTER",
          "description": "A character expression equal to the name of a table in the specified database. An unquoted character string is not permitted. If the table name is valid, DBRESTRICTIONS returns the list of unsupported features for the specified table. Otherwise, it returns the Unknown value (?).",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DBTASKID",
      "description": "Returns an INTEGER value that uniquely identifies a database's transaction.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBTASKID(1) returns information on the first database the ABL session is connected to, DBTASKID(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBTASKID function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the logical name or alias of a database that is connected to the current ABL session. If the character expression does not evaluate to the logical name or alias of a connected database, DBTASKID returns the Unknown value (?).Note: You must enclose all character strings in quotes.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "DBTYPE",
      "description": "Returns, as a character string, the database type of a currently connected database. This function returns one of the following strings: \"MSS\", \"ORACLE\", or \"PROGRESS\".",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBTYPE(1) returns information on the first database the ABL session is connected to, DBTYPE(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBTYPE function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "These forms of the DBTYPE function require a quoted character string or a character expression as a parameter. An unquoted character string is not permitted. If the parameter is an alias of a connected database or the logical name of a connected database, then the AVM returns the database type. Otherwise, it returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DBVERSION",
      "description": "Returns, as a character string, the version number of an OpenEdge database.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, DBVERSION(1) returns information on the first database the ABL session is connected to, DBVERSION(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the DBVERSION function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "These forms of the DBVERSION function require a quoted character string or a character expression as a parameter. If the parameter is an alias of a connected database or the logical name of a connected database, then the AVM returns the version number. Otherwise, it returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DECIMAL",
      "description": "Converts an expression of any data type, with the exception of BLOB, CLOB, and RAW, to a DECIMAL value.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "If expression is a CHARACTER, then it must be valid for conversion into a number. (For example, 1.67 is valid but 1.x3 is not valid.) If expression is LOGICAL, then the result is 0 if expression is FALSE and 1 if expression is TRUE. If expression is a DATE, then the result is the number of days from 1/1/4713 B.C. to that date. If the value of expression is the Unknown value (?), then the result is also the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "DECRYPT",
      "description": "Converts encrypted data (a binary byte stream) to its original source format, and returns a MEMPTR containing the decrypted data.",
      "parameters": [
        {
          "name": "data-to-decrypt",
          "type": "CHARACTER",
          "description": "The encrypted data to decrypt. The value may be of type RAW or MEMPTR.",
          "optional": false
        },
        {
          "name": "encrypt-key",
          "type": "RAW",
          "description": "An optional RAW expression that evaluates to the encryption key (a binary value) originally used to encrypt the specified data. If you specify the Unknown value (?), the current value of the SYMMETRIC-ENCRYPTION-KEY attribute is used. If the value of the SYMMETRIC-ENCRYPTION-KEY attribute is also the Unknown value (?), the AVM generates a run-time error.The AVM compares the size of the specified encryption key to the key size specified by the cryptographic algorithm. If the key sizes are inconsistent, the AVM generates a run-time error. You can use the GENERATE-PBE-KEY function to regenerate the same encryption key originally used to encrypt the specified data as long as you specify the same password string, hash algorithm, number of iterations, and salt value. Note: Do not use the GENERATE-RANDOM-KEY function to generate this encryption key. The random key it generates will always be different than the key originally used to encrypt the specified data. You are responsible for generating, storing, and transporting this value.",
          "optional": true
        },
        {
          "name": "iv-value",
          "type": "RAW",
          "description": "An optional RAW expression that evaluates to the initialization vector value to use with the specified encryption key in the original encryption operation. If you specify the Unknown value (?), the current value of the SYMMETRIC-ENCRYPTION-IV attribute is used.",
          "optional": true
        },
        {
          "name": "algorithm",
          "type": "CHARACTER",
          "description": "An optional CHARACTER expression that evaluates to the name of the symmetric cryptographic algorithm originally used to encrypt the specified data instance. If you specify the Unknown value (?), the current value of the SYMMETRIC-ENCRYPTION-ALGORITHM attribute is used. For a list the supported cryptographic algorithms, see the SYMMETRIC-SUPPORT attribute reference entry.",
          "optional": true
        }
      ],
      "returnType": "MEMPTR"
    },
    {
      "name": "DEFINED preprocessor",
      "description": "Returns the status of a preprocessor name or include file argument name as an INTEGER value. You can use the DEFINED function only within a preprocessor &IF expression.",
      "parameters": [
        {
          "name": "name",
          "type": "CHARACTER",
          "description": "Preprocessor name or include file argument name whose status you want to check. You do not specify name as a preprocessor name reference or include file argument reference. That is, it is not quoted and does not appear in the reference form, {&name}. For example if you had a preprocessor name MAX-EXPENSE, the argument would appear as follows: DEFINED(MAX-EXPENSE)",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "DYNAMIC-CAST",
      "description": "Returns a new object reference to the same class instance as an existing object reference, but with a different data type. This different data type is cast from the object type of the original object reference according to another object type specified by a run-time expression. The object types must be related, where one is a class type and the other is subclass of that class type or where one is an interface type and the other is a class that implements the interface of that type.",
      "parameters": [
        {
          "name": "object-reference",
          "type": "CHARACTER",
          "description": "An object reference defined with the object type to be cast.",
          "optional": false
        },
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the fully qualified type name for the ABL or .NET class or interface type to which the object reference is cast. This object type must be a class type in a class hierarchy that includes or implements the object-reference data type or it must be an interface type that the object-reference data type implements. However, the object type cannot be a .NET generic type. Specify an object type name using the syntax described in the Type-name syntax reference entry. Any present USING statement has no effect. If no package is specified, the class or interface name must represent the complete type name.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DYNAMIC-CURRENT-VALUE",
      "description": "Returns the current INT64 value of a sequence defined in the specified database.",
      "parameters": [
        {
          "name": "sequence-expression",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a sequence.",
          "optional": false
        },
        {
          "name": "logical-dbname-expression",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a connected database in which the sequence is defined.",
          "optional": false
        },
        {
          "name": "tenant-id",
          "type": "INTEGER",
          "description": "An integer expression that evaluates to the tenant ID of a regular tenant, including the default tenant (0). This option applies only to a multi-tenant sequence specified by sequence-expression and is intended for access primarily by a super-tenant user.",
          "optional": true
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "DYNAMIC-ENUM",
      "description": "Returns an instance of the enumeration type for the specified enumeration member.",
      "parameters": [
        {
          "name": "return-value",
          "type": "CHARACTER",
          "description": "Specifies a data element that is assigned the returned value. The AVM checks that the enum instance returned can be assigned to the target, and the AVM raises an error if the data types aren't compatible.",
          "optional": false
        },
        {
          "name": "enum-type-name",
          "type": "CHARACTER",
          "description": "Specifies the name of an ABL or .NET enumeration type that defines the member. This is a CHARACTER expression that the AVM evaluates to the type name of an enumeration type at runtime.",
          "optional": false
        },
        {
          "name": "enum-member",
          "type": "CHARACTER",
          "description": "Specifies an enum member in one of two ways: A CHARACTER expression that evaluates to the member name at runtime. For flag enums, this can be a comma-delimited list of member names for two or more members defined by the enum type. An INTEGER or INT64 expression that evaluates to the underlying numeric value of the member at runtime. For flag enums, this numeric value can represent two or more members defined by the enum type. Note: The function generates a runtime error if any specified character or numeric value does not correspond to a defined member.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "DYNAMIC-FUNCTION",
      "description": "Invokes a user-defined function. The AVM evaluates the name of the function (and the procedure handle, if any) at run time.",
      "parameters": [
        {
          "name": "function-name",
          "type": "CHARACTER",
          "description": "A CHARACTER expression that returns the name of a user-defined function. The AVM evaluates function-name at run time.",
          "optional": false
        },
        {
          "name": "proc-handle",
          "type": "HANDLE",
          "description": "An expression that returns a handle to the procedure that defines the function. The AVM evaluates proc-handle at run time.",
          "optional": false
        },
        {
          "name": "param1, param2, ...",
          "type": "CHARACTER",
          "description": "Parameters of the user-defined function. You must supply names of actual data items—actual parameter names—not CHARACTER expressions that return parameter names.Note: ABL cannot check the mode and type of the parameters at compile time, since the AVM does not evaluate function-name until run time.",
          "optional": false
        }
      ]
    },
    {
      "name": "DYNAMIC-INVOKE",
      "description": "Invokes a class-based method whose name is specified by a run-time expression, but whose parameters are defined at compile time.",
      "parameters": [
        {
          "name": "return-value",
          "type": "CHARACTER",
          "description": "An optional data element that is assigned the return value from the invoked, non-void method. The AVM checks return-value at run time for data type compatibility with what is actually returned by the method. ABL raises a run-time error if you invoke a void method where a return value is expected.",
          "optional": true
        },
        {
          "name": "class-type-name",
          "type": "CHARACTER",
          "description": "The name of an ABL or .NET class type that defines the specified method as a static member. If the method is static, this parameter is a CHARACTER expression that the AVM evaluates to the type name of the class at run time. This expression must specify a class type name as described in the Type-name syntax reference entry, except that you must always specify the complete type name; any present USING statement has no effect.You cannot use class-type-name to call an instance method. For more information on specifying class type names, see the Type-name syntax reference entry.",
          "optional": false
        },
        {
          "name": "object-reference",
          "type": "CHARACTER",
          "description": "Specifies a reference to an ABL or .NET class instance that defines the specified method as an instance member. You cannot use object-reference to call a static method. For information on specifying object references, see the reference entry for a Class-based object reference.",
          "optional": false
        },
        {
          "name": "method-name",
          "type": "CHARACTER",
          "description": "A CHARACTER expression that evaluates to the method name. The AVM evaluates method-name at run time.",
          "optional": false
        },
        {
          "name": "parameter",
          "type": "CHARACTER",
          "description": "Specifies zero or more parameters passed to the method. You must provide the parameters identified by the specified method, matched with respect to number, data type, and mode. To invoke a method that is overloaded in the class, you must specify sufficient information for each parameter in order to disambiguate methods that have similar parameter lists. Otherwise, the AVM raises an error identifying the ambiguity.If the parameter mode (INPUT, OUTPUT, INPUT-OUTPUT) is not specified, the mode defaults to INPUT. This differs from normal invocation of a method, where the parameter mode defaults to the method parameter. In this case, the compiler does not know the method at compile time, and therefore must use INPUT for the default, instead of inferring it from the called method. We recommended that you always supply the parameter mode. For more information on parameter passing syntax and on disambiguating overloaded ABL and .NET methods, see the Parameter passing syntax reference entry.",
          "optional": true
        }
      ]
    },
    {
      "name": "DYNAMIC-NEXT-VALUE",
      "description": "Returns the next INT64 value of a sequence, incremented by the positive or negative value defined in the specified database.",
      "parameters": [
        {
          "name": "sequence-expression",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a sequence.",
          "optional": false
        },
        {
          "name": "logical-dbname-expression",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a connected database in which the sequence is defined.",
          "optional": false
        },
        {
          "name": "tenant-id",
          "type": "INTEGER",
          "description": "An integer expression that evaluates to the tenant ID of a regular tenant, including the default tenant (0). This option applies only to a multi-tenant sequence specified by sequence-expression and is intended for access primarily by a super-tenant user. If you are a regular-tenant user and you specify tenant-id, the specified tenant must be the same as the tenant associated with the database connection identity for logical-dbname-expression or the AVM raises a run-time error. If you are a super-tenant user and you do not specify tenant-id, the function assumes the effective tenant ID (GET-EFFECTIVE-TENANT-ID function). If the sequence specified by sequence-expression is non-multi-tenant (a shared sequence in a multi-tenant database), and you specify tenant-id, the option is ignored.",
          "optional": true
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "DYNAMIC-PROPERTY",
      "description": "Returns the value of a class property. The function allows you to refer to a class property by providing a character expression for the property name, along with an object reference, THIS-OBJECT system reference, or the name of a class. The compiler supports both ABL user-defined types and .NET types for the object reference or class name.",
      "parameters": [
        {
          "name": "return-value",
          "type": "CHARACTER",
          "description": "Specifies a data element that is assigned the value returned when you execute the property's GET accessor. The AVM does the required conversions automatically as if there were a CAST or an ABL conversion function such as STRING or INTEGER present.",
          "optional": false
        },
        {
          "name": "object-reference",
          "type": "CHARACTER",
          "description": "Specifies a reference to an ABL or .NET class instance that exposes the specified property as an instance member. The compiler allows object-reference to be declared as any object type. At run time, the object type must resolve to the type that exposes the property.",
          "optional": false
        },
        {
          "name": "class-type-name",
          "type": "CHARACTER",
          "description": "Specifies the name of an ABL or .NET class type that defines the specified property as a static member. This is a CHARACTER expression that the AVM evaluates to the type name of a class at run time. It must only be the name of a class: interfaces are not valid.",
          "optional": false
        },
        {
          "name": "property-name",
          "type": "CHARACTER",
          "description": "Specifies a CHARACTER expression that evaluates to the property name at run time. Note: The function generates a run-time error if the property-name does not name a property exposed by the object-reference or a static property exposed by class-type-name. A run-time error also gets generated when the required property accessor is not accessible or does not exist. For example, an error is generated when there is an attempt to get the value of a protected property outside the class hierarchy where it is defined, or there is an attempt by the AVM to set a property that has no SET accessor.",
          "optional": false
        },
        {
          "name": "index",
          "type": "INTEGER",
          "description": "Specifies an integer expression for the index of the specified element. Use index to set or retrieve an individual array element. You can also operate on an entire array by removing the index the same way as you work with non-dynamic property access.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "ENCODE",
      "description": "Encodes a source character string and returns the encoded character string result.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression that results in a character string value. If you use a constant, you must enclose it in quotation marks (\" \").",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "ENCRYPT",
      "description": "Converts source data into a particular format, and returns a MEMPTR containing the encrypted data (a binary byte stream).",
      "parameters": [
        {
          "name": "data-to-encrypt",
          "type": "CHARACTER",
          "description": "The source data to encrypt. The value may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR.",
          "optional": false
        },
        {
          "name": "encrypt-key",
          "type": "RAW",
          "description": "An optional RAW expression that evaluates to the name of the encryption key (a binary value) to use in encrypting the specified data. If you specify the Unknown value (?), the current value of the SYMMETRIC-ENCRYPTION-KEY attribute is used. If the value of the SYMMETRIC-ENCRYPTION-KEY attribute is also the Unknown value (?), the AVM generates a run-time error.You can generate this encryption key, based on the PKCS#5/RFC 2898 standard, by using either the GENERATE-PBE-KEY function or the GENERATE-RANDOM-KEY function. Note: If you use the GENERATE-RANDOM-KEY function to generate an encryption key, be sure to invoke the function before invoking the ENCRYPT function (not within the ENCRYPT function, which would render the key irretrievable). The AVM compares the size of the specified encryption key to the key size specified by the cryptographic algorithm. If the key sizes are inconsistent, the AVM generates a run-time error. You are responsible for generating, storing, and transporting this value.",
          "optional": true
        },
        {
          "name": "iv-value",
          "type": "RAW",
          "description": "An optional RAW expression that evaluates to an initialization vector value to use with the specified encryption key in the encryption operation. Using an initialization vector value increases the strength of the specified encryption key (that is, it makes the key more unpredictable). If you specify the Unknown value (?), the current value of the SYMMETRIC-ENCRYPTION-IV attribute is used.",
          "optional": true
        },
        {
          "name": "algorithm",
          "type": "CHARACTER",
          "description": "An optional CHARACTER expression that evaluates to the name of the symmetric cryptographic algorithm to use in encrypting the specified data instance. If you specify the Unknown value (?), the current value of the SYMMETRIC-ENCRYPTION-ALGORITHM attribute is used. For a list the supported cryptographic algorithms, see the SYMMETRIC-SUPPORT attribute reference entry.",
          "optional": true
        }
      ],
      "returnType": "MEMPTR"
    },
    {
      "name": "ENTERED",
      "description": "Checks whether a frame field has been modified during the last INSERT, PROMPT-FOR, SET, or UPDATE statement for that field, and returns a TRUE or FALSE result.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The name of the frame field you are checking. If you omit the FRAME option, the field name must be unambiguous.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "ENTRY",
      "description": "Returns a character string (CHARACTER or LONGCHAR) entry from a list based on an integer position. The data type of the returned value matches the data type of the list element.",
      "parameters": [
        {
          "name": "element",
          "type": "INTEGER",
          "description": "An integer value that corresponds to the position of a character string in a list of values. If the value of element does not correspond to an entry in the list, the AVM raises the ERROR condition. If the value of element is the Unknown value (?), ENTRY returns the Unknown value (?). If element is less than or equal to 0, or is larger than the number of elements in list, ENTRY returns an error.",
          "optional": false
        },
        {
          "name": "list",
          "type": "CHARACTER",
          "description": "A list of character strings separated with a character delimiter. The list can be a variable of type CHARACTER or LONGCHAR. If the value of list is the Unknown value (?), ENTRY returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "character",
          "type": "CHARACTER",
          "description": "A delimiter you define for the list. The default is a comma. This allows the ENTRY function to operate on non-comma-separated lists. If you use an alphabetic character, this delimiter is case sensitive.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "ERROR",
      "description": "Indicates whether an error occurred during a FILL or SAVE-ROW-CHANGES operation on the specified ProDataSet temp-table buffer.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "The name of a ProDataSet temp-table buffer.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "ETIME",
      "description": "Returns, as an INT64 value, the time (in milliseconds) elapsed since the ABL session began or since ETIME (elapsed time) was last set to 0. To set ETIME to 0, pass it a positive logical value, such as YES or TRUE.",
      "parameters": [
        {
          "name": "logical",
          "type": "LOGICAL",
          "description": "A logical value, such as YES or TRUE. The default value is NO.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "EXP",
      "description": "Returns the result of raising a number to a power. The number is called the base and the power is called the exponent.",
      "parameters": [
        {
          "name": "base",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that evaluates to a numeric value.",
          "optional": false
        },
        {
          "name": "exponent",
          "type": "INTEGER",
          "description": "A numeric expression.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "EXTENT",
      "description": "This function returns the extent of an array field or variable as an INTEGER value. More specifically, it returns:",
      "parameters": [
        {
          "name": "array",
          "type": "CHARACTER",
          "description": "Any array field or variable.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "FILL",
      "description": "Generates a character string made up of a character string that is repeated a specified number of times.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression that yields a character value. This expression can contain double-byte characters.",
          "optional": false
        },
        {
          "name": "repeats",
          "type": "INTEGER",
          "description": "A constant, field name, variable name, or expression with an integer value. The FILL function uses this value to repeat the expression you specify. If the value of repeats is less than or equal to 0, FILL produces a null string.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "FIRST",
      "description": "Returns a TRUE value if the current iteration of a DO, FOR EACH, or REPEAT . . . BREAK block is the first iteration of that block.",
      "parameters": [
        {
          "name": "break-group",
          "type": "CHARACTER",
          "description": "The name of a field or expression you name in the block header with the BREAK BY option.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "FIRST-OF",
      "description": "Returns a TRUE value if the current iteration of a DO, FOR EACH, or REPEAT . . . BREAK block is the first iteration for a new break group, and modifies all three block types.",
      "parameters": [
        {
          "name": "break-group",
          "type": "CHARACTER",
          "description": "The name of a field or expression you name in the block header with the BREAK BY option.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "FRAME-COL",
      "description": "Returns a DECIMAL value that is the column position of the left corner of a frame within its window.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The name of the frame whose column position you are trying to determine. If you do not supply a frame name, the FRAME-COL function uses the default frame for the block it is in. If the FRAME-COL function is in a DO block, the function uses the default frame scoped to the block containing the DO block.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "FRAME-DB",
      "description": "Returns the logical database name of the database that contains any field in which the user-interface cursor is entered.",
      "returnType": "CHARACTER"
    },
    {
      "name": "FRAME-DOWN",
      "description": "Returns an INTEGER value that represents the number of iterations in a frame.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The name of the frame whose number down you are trying to determine. If you do not supply a frame name, the FRAME-DOWN function uses the default frame for the block it is in. If the FRAME-DOWN function is in a DO block, the function uses the default frame scoped to the block containing the DO block.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "FRAME-FIELD",
      "description": "During a data entry statement, returns the name of the input field the cursor is in. At other times, returns the name of the input field the cursor was last in.",
      "returnType": "CHARACTER"
    },
    {
      "name": "FRAME-FILE",
      "description": "Returns the name of the database table that contains the field the cursor is in. The FRAME-FILE function is useful if you want to provide users with context-sensitive help.",
      "returnType": "CHARACTER"
    },
    {
      "name": "FRAME-INDEX",
      "description": "During a data entry statement, returns the subscript of the array element of the input field that the cursor is in as an INTEGER value. At other times, returns the subscript of the array element the cursor was in.",
      "returnType": "INTEGER"
    },
    {
      "name": "FRAME-LINE",
      "description": "Returns an INTEGER value that represents the current logical line number in a down frame.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The frame name that you are trying to determine a line number for. If you do not supply a frame name, the FRAME-LINE function uses the default frame for the block that contains the FRAME-LINE function. If the FRAME-LINE function is in a DO block, the function uses the default frame scoped to the block that contains the DO block.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "FRAME-NAME",
      "description": "Returns the name of the frame that the cursor is in to a field that is enabled for input.",
      "returnType": "CHARACTER"
    },
    {
      "name": "FRAME-ROW",
      "description": "Returns a DECIMAL value that represents the row position of the upper-left corner of a frame within its window.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The name of the frame whose row position you are trying to determine. If you do not supply a frame name, the FRAME-ROW function uses the default frame for the block that contains the FRAME-ROW function. If the FRAME-ROW function is in a DO block, the function uses the default frame scoped to the block that contains the DO block.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "FRAME-VALUE",
      "description": "During a data entry statement, returns the (character string) value of the input field that the cursor is in to the current input field. At other times, returns the (character string) value of the input field the cursor was last in.",
      "returnType": "CHARACTER"
    },
    {
      "name": "FUNCTION statement",
      "description": "Defines or declares a prototype for a user-defined function, or declares a Web service operation. The following syntax boxes describe the syntax for each use of the statement, beginning with a user-defined function definition.",
      "parameters": [
        {
          "name": "function-name",
          "type": "CHARACTER",
          "description": "The name of the function. You must avoid ABL reserved keywords. For a list of ABL keywords, see Keyword Index.",
          "optional": false
        },
        {
          "name": "return-type",
          "type": "INTEGER",
          "description": "Indicates the data type of the function return value. You can specify return-type as one of the following data types. For more information on each data type, see the Data types reference entry: { CHARACTER | COM-HANDLE | DATE | DATETIME | DATETIME-TZ | DECIMAL | HANDLE | INT64 | INTEGER | LOGICAL | LONGCHAR | MEMPTR | RAW | RECID | ROWID | [ CLASS ] object-type-name } [ EXTENT [ constant ] ] object-type-name Specifies the type name of an ABL or .NET class or interface. Specify an object type name using the syntax described in the Type-name syntax reference entry. With an appropriate USING statement, you can also specify a class or interface name alone, without the qualifying package or namespace. CLASS If the specified class or interface type name conflicts with an abbreviation of a built-in primitive type name, such as INT for INTEGER, you must specify the CLASS keyword. For a class or interface return value, ABL returns an object reference associated with the class or interface, not a class instance itself. For more information on object references, see the Class-based object reference reference entry. EXTENT [constant ] Defines the return value as an array of data elements with the specified primitive or object type. This option can specify an array return value as either determinate (has a defined number of elements) or indeterminate (has an undefined number of elements). To define a determinate array return value, specify the EXTENT option with the constant argument. This optional argument is an integer value that represents the number of elements in the array. To define an indeterminate array return value, specify the EXTENT option without the constant argument.An indeterminate array return value can be in one of two states: fixed or unfixed, meaning it either has a fixed dimension or it does not. An indeterminate array return value has an unfixed dimension when first defined. You can fix the dimension of an indeterminate array return value by: Setting the number of elements in the array return value using the EXTENT statement Assigning a determinate array to the indeterminate array value, fixing it to the dimension of the determinate array Passing array parameters to a procedure, user-defined function, or class-based method, so that the indeterminate array value is the target for the passing of a determinate array, fixing the indeterminate array to the dimension of the determinate array Once fixed, ABL treats a fixed indeterminate array as a determinate array. If you do not use the EXTENT option (or you specify constant as 0), the return value is not an array return value. Note: If you invoke a function on an application server, the function cannot return a value as a LONGCHAR, MEMPTR, or CLASS.",
          "optional": false
        },
        {
          "name": "object-type-name",
          "type": "CHARACTER",
          "description": "Specifies the type name of an ABL or .NET class or interface. Specify an object type name using the syntax described in the Type-name syntax reference entry. With an appropriate USING statement, you can also specify a class or interface name alone, without the qualifying package or namespace.",
          "optional": false
        },
        {
          "name": "constant",
          "type": "INTEGER",
          "description": "Defines the return value as an array of data elements with the specified primitive or object type. This option can specify an array return value as either determinate (has a defined number of elements) or indeterminate (has an undefined number of elements). To define a determinate array return value, specify the EXTENT option with the constant argument. This optional argument is an integer value that represents the number of elements in the array. To define an indeterminate array return value, specify the EXTENT option without the constant argument.An indeterminate array return value can be in one of two states: fixed or unfixed, meaning it either has a fixed dimension or it does not. An indeterminate array return value has an unfixed dimension when first defined. You can fix the dimension of an indeterminate array return value by: Setting the number of elements in the array return value using the EXTENT statement Assigning a determinate array to the indeterminate array value, fixing it to the dimension of the determinate array Passing array parameters to a procedure, user-defined function, or class-based method, so that the indeterminate array value is the target for the passing of a determinate array, fixing the indeterminate array to the dimension of the determinate array Once fixed, ABL treats a fixed indeterminate array as a determinate array. If you do not use the EXTENT option (or you specify constant as 0), the return value is not an array return value.",
          "optional": false
        },
        {
          "name": "parameter",
          "type": "CHARACTER",
          "description": "Defines one or more parameters of the function. For information on the parameter definition syntax, see the Parameter definition syntax reference entry.",
          "optional": true
        },
        {
          "name": "function-body",
          "type": "CHARACTER",
          "description": "The body of a function definition. Define function-body using the following syntax: function-logic . . . [ catch-block [ catch-block ... ] ] [ finally-block ] END [ FUNCTION ] . function-logic The logic of the function. This logic can contain the ABL statements allowed within a procedure block, except that the RETURN ERROR statement returns the Unknown value (?) for the function, regardless of its return type, but does not raise ERROR in the caller. To return a function value of the data type specified by return-type, you can execute the RETURN statement to set a value of that data type to return at run time. If you omit the RETURN statement, the function returns the Unknown value (?), regardless of the data type specified by return-type. If return-type is defined as a .NET array of mapped types (for example, \"System.Byte[]\"), you must return an object reference of the specified .NET array of mapped types in the RETURN statement. You cannot return an ABL array of a type that maps to the .NET array type (for example, INTEGER EXTENT) or the AVM raises a run-time error. If you do not execute any RETURN statement for return-type in the function-logic, the user-defined function returns the Unknown value (?) as its return value. Each logic statement must end with a period. catch-block Specifies a CATCH statement that defines error handling code for one or more error types. A DO block does not have any default error handling. Therefore, a DO block must have error handling options specified such that it becomes an undoable block. Otherwise, ABL generates a compiler warning. For more information on catch-block, see the CATCH statement reference entry. finally-block Specifies a FINALLY statement that defines the processing that must occur after all other processing in the block occurs. For more information on finally-block, see the FINALLY statement reference entry. END [ FUNCTION ] Specifies the end of the function body definition. You must end the function body definition with the END statement.",
          "optional": false
        },
        {
          "name": "function-logic",
          "type": "CHARACTER",
          "description": "The logic of the function. This logic can contain the ABL statements allowed within a procedure block, except that the RETURN ERROR statement returns the Unknown value (?) for the function, regardless of its return type, but does not raise ERROR in the caller. To return a function value of the data type specified by return-type, you can execute the RETURN statement to set a value of that data type to return at run time. If you omit the RETURN statement, the function returns the Unknown value (?), regardless of the data type specified by return-type. If return-type is defined as a .NET array of mapped types (for example, \"System.Byte[]\"), you must return an object reference of the specified .NET array of mapped types in the RETURN statement. You cannot return an ABL array of a type that maps to the .NET array type (for example, INTEGER EXTENT) or the AVM raises a run-time error. If you do not execute any RETURN statement for return-type in the function-logic, the user-defined function returns the Unknown value (?) as its return value. Each logic statement must end with a period.",
          "optional": false
        },
        {
          "name": "catch-block",
          "type": "CHARACTER",
          "description": "Specifies a CATCH statement that defines error handling code for one or more error types. A DO block does not have any default error handling. Therefore, a DO block must have error handling options specified such that it becomes an undoable block. Otherwise, ABL generates a compiler warning. For more information on catch-block, see the CATCH statement reference entry.",
          "optional": false
        },
        {
          "name": "finally-block",
          "type": "CHARACTER",
          "description": "Specifies a FINALLY statement that defines the processing that must occur after all other processing in the block occurs. For more information on finally-block, see the FINALLY statement reference entry.",
          "optional": false
        },
        {
          "name": "actual-name",
          "type": "HANDLE",
          "description": "Declares prototype for a function that resides in a procedure external to the declaring procedure, with the following information: Optionally, that function-name (the second element in the FUNCTION statement) is an alias (alternative name) for the function and that actual-name is the name that appears in the function definition. The definition of the function resides in another external procedure specified by proc-handle, which represents an expression that evaluates to a handle to the procedure that defines the function. This procedure can be an active procedure in the local context or in a remote persistent, single-run, or singleton procedure. Note: The MAP option might simplify your code if it references two different user-defined functions that have the same name but that reside in different procedures. A FUNCTION statement with the IN proc-handle option must include the following information on the function: the data type it returns, and the data type and mode (INPUT, OUTPUT, or INPUT-OUTPUT) of each parameter.",
          "optional": false
        },
        {
          "name": "operationName",
          "type": "CHARACTER",
          "description": "The name of a Web service operation specified in a WSDL file.",
          "optional": false
        },
        {
          "name": "hPortType",
          "type": "HANDLE",
          "description": "A handle to a procedure object that encapsulates a Web service operation.",
          "optional": false
        }
      ]
    },
    {
      "name": "GATEWAYS",
      "description": "The GATEWAYS function has been replaced by the DATASERVERS function, which is exactly equivalent."
    },
    {
      "name": "GENERATE-PBE-KEY",
      "description": "Generates a password-based encryption key, based on the PKCS#5/RFC 2898 standard, and returns the key as a RAW value.",
      "parameters": [
        {
          "name": "password",
          "type": "CHARACTER",
          "description": "The password (a binary value) to use in generating the encryption key. This value may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the password contains a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings) before using it to generate the encryption key. To avoid this automatic conversion, specify a RAW or MEMPTR value. If you specify the Unknown value (?), the result is the Unknown value (?).",
          "optional": false
        },
        {
          "name": "salt",
          "type": "RAW",
          "description": "An optional RAW expression that evaluates to the salt value (a random series of 8 bytes) to use in generating the encryption key. If you specify the Unknown value (?), the current value of the ENCRYPTION-SALT attribute is used. If no salt value is specified in the ENCRYPTION-SALT attribute, no salt value is used.You can also use the GENERATE-PBE-SALT function to generate a salt value, which can help to ensure that the password key value is unique. If specified, this salt value is combined with the password value and hashed some number of times to generate a password-based encryption key (using the algorithm specified by the PBE-HASH-ALGORITHM attribute and the number of iterations specified by the PBE-KEY-ROUNDS attribute).",
          "optional": true
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "GENERATE-PBE-SALT",
      "description": "Generates a random salt value (a series of 8 bytes) to use in generating an encryption key, and returns the salt value as a RAW value. Using a salt value can help to ensure that a password key value is unique.",
      "returnType": "RAW"
    },
    {
      "name": "GENERATE-RANDOM-KEY",
      "description": "Generates a pseudorandom (rather than a truly random) series of bytes to use as an encryption key, and returns the key as a RAW value.",
      "returnType": "RAW"
    },
    {
      "name": "GENERATE-UUID",
      "description": "Generates a universally unique identifier (UUID), as a 16-byte RAW value.",
      "returnType": "RAW"
    },
    {
      "name": "GET-BITS",
      "description": "Interprets one or more consecutive bits in an integer variable or field as an ABL integer value and returns that value.",
      "parameters": [
        {
          "name": "source",
          "type": "INTEGER",
          "description": "An ABL integer variable.",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "A variable or expression that returns an integer. This parameter designates the position of the lowest-order bit of the bits that are to be interpreted as an integer. Bits are numbered from 1 through the length of an integer; with 1 being the low-order bit. If position is greater than the length of an integer, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        },
        {
          "name": "numbits",
          "type": "INTEGER",
          "description": "The number of bits to examine when generating the return value. If position plus numbits is greater than the length of an integer plus 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-BYTE",
      "description": "Returns the unsigned 1 byte value at the specified memory location as an INTEGER value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-BYTE returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-BYTE-ORDER",
      "description": "Returns an INTEGER value indicating the byte order setting of a MEMPTR variable. This will be either the value provided by the last execution of SET-BYTE-ORDER with this MEMPTR variable, or HOST-BYTE-ORDER if SET-BYTE-ORDER has not been executed.",
      "parameters": [
        {
          "name": "memptr",
          "type": "MEMPTR",
          "description": "An expression that returns a MEMPTR.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-BYTES",
      "description": "Returns the specified number of bytes, from the specified location, into a RAW or MEMPTR variable.",
      "parameters": [
        {
          "name": "source",
          "type": "CHARACTER",
          "description": "An expression that evaluates to a RAW or MEMPTR value indicating the source location. If source is the Unknown value (?), GET-BYTES returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 indicating the byte position of the first byte to get. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        },
        {
          "name": "numbytes",
          "type": "INTEGER",
          "description": "An integer value greater than 0 indicating how many bytes to return as a RAW value. If position plus numbytes is greater than the size of source, the AVM returns the Unknown value (?).If the variable that accepts the returned data is a RAW variable and numbytes is greater than its length but less than or equal to 32K, the AVM increases the size of the variable to numbytes. If either the source location, source, or the variable that accepts the returned data is a RAW value, and numbytes is greater than 32K, the AVM generates a run-time error. If the variable that accepts the returned data is a MEMPTR variable and numbytes is greater than its length, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "GET-CLASS",
      "description": "Returns the object reference for the Progress.Lang.Class instance associated with the specified class or interface type.",
      "parameters": [
        {
          "name": "object-type-name",
          "type": "CHARACTER",
          "description": "Specifies the type name of an ABL or .NET class or interface type, using the syntax described in the Type-name syntax reference entry. With an appropriate USING statement, you can also specify an unqualified class or interface name alone. If object-type-name is not the name of an existing ABL class that can be found on PROPATH or (for Windows) a .NET class that can be resolved based on the assemblies.xml file in use, a compiler error will result.",
          "optional": false
        }
      ]
    },
    {
      "name": "GET-CODEPAGE",
      "description": "The GET-CODEPAGE function returns the code page of a LONGCHAR variable or CLOB field.",
      "parameters": [
        {
          "name": "large-char-object",
          "type": "CHARACTER",
          "description": "The name of a LONGCHAR variable or CLOB field. If the specified LONGCHAR is empty and the code page was not fixed using the FIX-CODEPAGE statement, the AVM returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-CODEPAGES",
      "description": "The GET-CODEPAGES function returns a comma-delimited list of the code pages listed in convmap.cp or specified by the Conversion Map (-convmap) startup parameter for the current ABL session.",
      "returnType": "INTEGER"
    },
    {
      "name": "GET-COLLATION",
      "description": "The GET-COLLATION function returns the collation name for a CLOB field.",
      "parameters": [
        {
          "name": "clob-field",
          "type": "CHARACTER",
          "description": "A CLOB field name.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "GET-COLLATIONS",
      "description": "The GET-COLLATIONS function returns a comma-delimited list of the collations either listed in convmap.cp or specified by the Conversion Map (-convmap) startup parameter for the specified code page.",
      "parameters": [
        {
          "name": "codepage",
          "type": "CHARACTER",
          "description": "A code page name. If there are no collations for the specified code page, the AVM returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "GET-DB-CLIENT",
      "description": "Returns the handle to a copy of the sealed client-principal object that represents the user identity for the specified database connection.",
      "parameters": [
        {
          "name": "db-exp",
          "type": "CHARACTER",
          "description": "An optional character expression that evaluates to a case-insensitive logical or alias name of an OpenEdge RDBMS. This expression can be unspecified or evaluate to the Unknown value (?) only if there is a single OpenEdge database connection, in which case the client-principal object handle is returned for that connection.",
          "optional": true
        }
      ],
      "returnType": "HANDLE"
    },
    {
      "name": "GET-DOUBLE",
      "description": "Returns the 8-byte floating-point value at the specified memory location as a DECIMAL value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-DOUBLE returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "GET-EFFECTIVE-TENANT-ID",
      "description": "Returns the tenant ID of the effective tenant as an integer.",
      "parameters": [
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-EFFECTIVE-TENANT-NAME",
      "description": "Returns the name of the effective tenant as a character string.",
      "parameters": [
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "GET-FLOAT",
      "description": "Returns the 4-byte floating-point value at the specified memory location as a DECIMAL value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-FLOAT returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "GET-INT64",
      "description": "Returns the signed 64-bit value at the specified memory location as an INT64 value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-INT64 returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "GET-LONG",
      "description": "Returns the signed 32-bit value at the specified memory location as an INTEGER value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-LONG returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-POINTER-VALUE",
      "description": "Returns, as an INT64 value, the address of (or pointer to) the memory region associated with the specified MEMPTR variable. The returned value is based on whether the platform supports 64-bit pointers or 32-bit pointers. On a 32-bit platform, the value never gets bigger than 2GB.",
      "parameters": [
        {
          "name": "memptr-var",
          "type": "MEMPTR",
          "description": "A reference to a variable defined as MEMPTR. If the variable is uninitialized (has no associated memory region), the function returns 0.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "GET-SHORT",
      "description": "Returns the signed 16-bit value at the specified memory location as an INTEGER value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-SHORT returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GET-SIZE",
      "description": "Returns, as an INT64 value, the allocated byte size of the memory region associated with the specified MEMPTR variable.",
      "parameters": [
        {
          "name": "memptr-var",
          "type": "MEMPTR",
          "description": "A MEMPTR variable. If the variable is uninitialized (has no associated memory region), the function returns 0.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "GET-STRING",
      "description": "Returns the null-terminated character string at the specified memory location as a CHARACTER value (not including the null terminator) or the number of bytes specified starting from the specified memory location as a CHARACTER value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-STRING returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        },
        {
          "name": "numbytes",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates how many bytes to convert into the CHARACTER value that is returned. If numbytes is not specified, or is -1, GET-STRING( ) returns all bytes until it encounters a NULL value.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "GET-UNSIGNED-LONG",
      "description": "Returns the unsigned 32-bit value at the specified memory location as an INT64. This is analogous to the GET-UNSIGNED-SHORT function, except with a 32-bit value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-UNSIGNED-LONG returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An INTEGER or INT64 value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "GET-UNSIGNED-SHORT",
      "description": "Returns the unsigned 16-bit value at the specified memory location as an INTEGER value.",
      "parameters": [
        {
          "name": "source",
          "type": "RAW",
          "description": "A function or variable that returns a RAW or MEMPTR value. If source is the Unknown value (?), GET-UNSIGNED-SHORT returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer value greater than 0 that indicates the byte position where you want to find the information. If position is greater than the length of source, the AVM returns the Unknown value (?). If position is less than 1, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "GO-PENDING",
      "description": "Returns a TRUE value if, within an EDITING phrase, an APPLY statement results in a GO action. The GO action is deferred until the end of the EDITING phrase.",
      "returnType": "LOGICAL"
    },
    {
      "name": "GUID",
      "description": "Converts a universally unique identifier (UUID) value into a globally unique identifier (GUID) value. This function returns a GUID as a 36-character string value consisting of 32 hexadecimal digits (0 through 9 and A through F) and 4 hyphens formatted as follows (where X is a hexadecimal digit): XXXXXXXX—XXXX—XXXX—XXXX—XXXXXXXXXXXX.",
      "parameters": [
        {
          "name": "UUID",
          "type": "RAW",
          "description": "An optional 16-byte raw UUID value to be converted. If the specified UUID is not exactly 16 bytes in length, the AVM returns the Unknown value (?). If not specified, the AVM generates a UUID and then converts it into a GUID.",
          "optional": true
        }
      ],
      "returnType": "GUID"
    },
    {
      "name": "HANDLE",
      "description": "Converts a string representation of a handle to a valid handle. If the string does not correlate to a valid handle in the session, the function returns 0.",
      "parameters": [
        {
          "name": "handle-string",
          "type": "HANDLE",
          "description": "A string representation of a handle. Since handles are integer values, the string must contain only numeric characters.",
          "optional": false
        }
      ],
      "returnType": "HANDLE"
    },
    {
      "name": "HEX-DECODE",
      "description": "Converts a character string consisting of an even number of hexadecimal digits (0 through 9 and A through F) into a RAW value.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A character expression containing the value you want to convert. If the expression does not contain an even number of hexadecimal digits, or it is the Unknown value (?), the result is the Unknown value (?). If the expression is a zero-length value, the result is a zero-length value.",
          "optional": false
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "HEX-ENCODE",
      "description": "Converts a RAW value into a character string consisting of an even number of hexadecimal digits (0 through 9 and A through F).",
      "parameters": [
        {
          "name": "expression",
          "type": "RAW",
          "description": "A RAW expression containing the value you want to convert. If the expression is the Unknown value (?), the result is the Unknown value (?). If the expression is a zero-length value, the result is a zero-length value.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "IF...THEN...ELSE",
      "description": "Evaluates and returns one of two expressions, depending on the value of a specified condition.",
      "parameters": [
        {
          "name": "condition",
          "type": "LOGICAL",
          "description": "An expression whose value is logical (TRUE or FALSE).",
          "optional": false
        },
        {
          "name": "expression1",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression. If the condition is TRUE, then the function returns this value.",
          "optional": false
        },
        {
          "name": "expression2",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression whose value is of a data type that is compatible with the data type of expression1. If the condition is FALSE or the Unknown value (?), then the function returns this value.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "INDEX",
      "description": "Returns an INTEGER value that indicates the position of a search string within a source string.",
      "parameters": [
        {
          "name": "source",
          "type": "CHARACTER",
          "description": "A CHARACTER, LONGCHAR or MEMPTR expression.",
          "optional": false
        },
        {
          "name": "searchString",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression whose position you want to locate in source. If searchString does not exist within source, INDEX returns 0.",
          "optional": false
        },
        {
          "name": "starting",
          "type": "INTEGER",
          "description": "An integer that specifies at which left-most position in the string to start the search. For example, INDEX(\"abcdefabcdef\",\"abc\",6) returns 7.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "INPUT",
      "description": "References the value of a field in a frame. For example, if you use the PROMPT-FOR statement to get input from the user, PROMPT-FOR stores that information in the screen buffer. You can use the INPUT function to refer to that information.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The name of the frame that contains the field named by the field argument. If you do not name a frame, the INPUT function starts with the current frame and searches outward until it finds the field you name with the field argument.",
          "optional": false
        },
        {
          "name": "field",
          "type": "CHARACTER",
          "description": "The name of a field or variable whose value is stored in the screen buffer. The specified field must be viewed as a fill-in or text widget.",
          "optional": false
        }
      ]
    },
    {
      "name": "INT64",
      "description": "Takes any data type and returns an INT64 value, if the conversion is possible. This function takes most common data types except for RAW and MEMPTR.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression whose value can be of any data type except for RAW and MEMPTR. The function behaves as described for the following data types:If the value of expression is a CHARACTER, it must be valid for conversion into a number (for example, \"1.67\" is valid, \"1.x3\" is not). If expression is an object reference (CLASS), the result is the ABL-generated ID for the class instance. If expression is a reference to an instance of an enum, the result is the underlying numeric value of that instance. If expression is a LOGICAL, the result is 0 if expression is FALSE and the result is 1 if expression is TRUE. If expression is a DATE, the result is the number of days from 1/1/4713 B.C. to that day. If expression is the Unknown value (?), the result is the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "INTEGER",
      "description": "Converts an expression of any data type, with the exception of BLOB, CLOB, and RAW, to a 32-bit integer value of data type INTEGER, rounding that value if necessary.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression. The function behaves as described for the following data types: If the value of expression is a CHARACTER, it must be valid for conversion into a number (for example, \"1.67\" is valid, \"1.x3\" is not). If expression is an object reference (CLASS), the result is the ABL-generated ID for the class instance. If expression is a reference to an instance of an enum, the result is the underlying numeric value of that instance. Because the underlying numeric values of enum members are of type INT64, the function may raise an error if the value cannot be represented as an INTEGER. If expression is a LOGICAL, the result is 0 if expression is FALSE and the result is 1 if expression is TRUE. If expression is a DATE, the result is the number of days from 1/1/4713 B.C. to that day. If expression is the Unknown value (?), the result is the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "INTERVAL",
      "description": "Returns the time interval between two DATE, DATETIME, or DATETIME-TZ values as an INT64 value.",
      "parameters": [
        {
          "name": "datetime1",
          "type": "DATE",
          "description": "An expression whose value is a DATE, DATETIME, or DATETIME-TZ.",
          "optional": false
        },
        {
          "name": "datetime2",
          "type": "DATE",
          "description": "An expression whose value is a DATE, DATETIME, or DATETIME-TZ.",
          "optional": false
        },
        {
          "name": "interval-unit",
          "type": "CHARACTER",
          "description": "A character constant, or a character expression that evaluates to one of the following time units: ‘years', ‘months', ‘weeks', ‘days', 'hours', ‘minutes', ‘seconds' or ‘milliseconds'. These values are case insensitive and might be singular.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "IS-ATTR-SPACE",
      "description": "This function is supported only for backward compatibility."
    },
    {
      "name": "IS-CODEPAGE-FIXED",
      "description": "Returns TRUE if the code page of the specified LONGCHAR variable is fixed; otherwise it returns FALSE.",
      "parameters": [
        {
          "name": "longchar",
          "type": "CHARACTER",
          "description": "The name of a LONGCHAR variable.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "IS-COLUMN-CODEPAGE",
      "description": "Returns TRUE if the specified CLOB field is a COLUMN-CODEPAGE CLOB. Otherwise, it returns FALSE (that is, if the CLOB is a DBCODEPAGE CLOB or a TTCODEPAGE CLOB).",
      "parameters": [
        {
          "name": "field",
          "type": "CHARACTER",
          "description": "The name of a CLOB field.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "IS-DB-MULTI-TENANT",
      "description": "Returns TRUE if a specified database is multi-tenant enabled, and returns FALSE if it is not.",
      "parameters": [
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "IS-LEAD-BYTE",
      "description": "Returns TRUE if the first character of the string is the lead-byte of a multi-byte character. Returns FALSE if it is not.",
      "parameters": [
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "A character expression (a constant, field name, variable name, or any combination of these) whose value is a character.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "ISO-DATE",
      "description": "Returns a character representation of a DATE, DATETIME , or DATETIME-TZ that conforms to the ISO 8601 standard for date/time representations.",
      "parameters": [
        {
          "name": "expression",
          "type": "DATE",
          "description": "An expression that evaluates to a DATE, DATETIME or DATETIME-TZ. The ISO-DATE function returns the character string in the standard ISO format of the data type. The following table lists the standard ISO formats for each data type. Standard ISO formats Data type ISO format DATE YYYY-MM-DD DATETIME YYYY-MM-DDTHH:MM:SS.SSS DATETIME-TZ YYYY-MM-DDTHH:MM:SS.SSS+HH:MM",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "KBLABEL",
      "description": "Returns the keyboard label (such as F1) of the key that performs a specified ABL function (such as GO).",
      "parameters": [
        {
          "name": "key-function",
          "type": "CHARACTER",
          "description": "An expression whose value is the name of the special ABL key function. See OpenEdge Programming Interfaces for possible values of key-name. If key-function is a constant, enclose it in quotation marks (\"\"). See the same guide for a list of key functions and the corresponding standard keyboard keys.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "KEYCODE",
      "description": "Evaluates a key label (such as F1) for a key in the predefined set of keyboard keys and returns the corresponding = key code (such as 301) as an INTEGER value. See OpenEdge Programming Interfaces for a list of key codes and key labels.",
      "parameters": [
        {
          "name": "key-label",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that evaluates to a character string that contains a key label. If key-label is a constant, enclose it in quotation marks (\" \").",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "KEYFUNCTION",
      "description": "Evaluates an integer expression (such as 301) and returns a character string that is the function of the key associated with that integer expression (such as GO).",
      "parameters": [
        {
          "name": "expression",
          "type": "INTEGER",
          "description": "A constant, field name, variable name, or expression whose value is an integer key code.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "KEYLABEL",
      "description": "Evaluates a key code (such as 301) and returns a character string that is the predefined keyboard label for that key (such as F1).",
      "parameters": [
        {
          "name": "key-code",
          "type": "INTEGER",
          "description": "The key code of the key whose label you want to know. A special case of key-code is LASTKEY. See OpenEdge Programming Interfaces for a list of key codes and key labels.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "KEYWORD",
      "description": "Returns a character value that indicates whether a string is an ABL reserved keyword.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that results in a character string. If expression matches an ABL reserved keyword or valid abbreviation of a reserved keyword, the KEYWORD function returns the full keyword. If there is no match, the KEYWORD function returns the Unknown value (?).In some cases, the abbreviation for a keyword is also a keyword. For example, if expression is \"def\" (the abbreviation for DEFINE) or \"col\" (the abbreviation for COLUMN), the KEYWORD function returns the values \"def\" and \"col\", respectively. If you use the Run-time client, the KEYWORD function always returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "KEYWORD-ALL",
      "description": "Returns a character value that indicates whether a string is an ABL keyword. This function returns all keywords and does not distinguish between reserved or unreserved keywords.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that results in a character string. If expression matches an ABL keyword, whether reserved or unreserved or valid abbreviation of a keyword, the KEYWORD-ALL function returns the full keyword. If there is no match, the KEYWORD-ALL function returns the Unknown value (?).In some cases, the abbreviation for a keyword is also a keyword. For example, if expression is \"def\" (the abbreviation for DEFINE) or \"col\" (the abbreviation for COLUMN), the KEYWORD function returns the values \"def\" and \"col\", respectively. If you use the Run-time client, the KEYWORD-ALL function always returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "LAST",
      "description": "Returns a TRUE value if the current iteration of a DO, FOR EACH, or REPEAT . . . BREAK block is the last iteration of that block.",
      "parameters": [
        {
          "name": "break-group",
          "type": "CHARACTER",
          "description": "The name of a field or expression you named in the block header with the BREAK BY option.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "LASTKEY",
      "description": "Returns, as an INTEGER value, the integer key code of the most recent event read from the user (that is, from the keyboard or mouse) during an interaction with a procedure.",
      "returnType": "INTEGER"
    },
    {
      "name": "LAST-OF",
      "description": "Returns a TRUE value if the current iteration of a DO, FOR EACH, or REPEAT . . . BREAK block is the last iteration for a particular value of a break group.",
      "parameters": [
        {
          "name": "break-group",
          "type": "CHARACTER",
          "description": "The name of a field or expression you named in the block header with the BREAK BY option.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "LC",
      "description": "Converts any uppercase characters in a CHARACTER or LONGCHAR expression to lowercase characters, and returns the result. The data type of the returned value matches the data type of the expression passed to the function.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that results in a CHARACTER or LONGCHAR value.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "LDBNAME",
      "description": "Returns the logical name of a database that is currently connected.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "The sequence number of a database the ABL session is connected to. For example, LDBNAME(1) returns information on the first database the ABL session is connected to, LDBNAME(2) returns information on the second database the ABL session is connected to, etc. If you specify a sequence number that does not correspond to a database the ABL session is connected to, the LDBNAME function returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "These forms of the LDBNAME function require a quoted character string or a character expression as a parameter. If the parameter is the logical name of a connected database or an alias of a connected database then the logical name is returned. Otherwise, the AVM returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "bufname",
          "type": "CHARACTER",
          "description": "The name of a database table or buffer. The BUFFER option lets you determine the database a certain table belongs to without hard-coding the logical database name or alias.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "LEFT-TRIM",
      "description": "Removes leading white space, or other specified characters, from a CHARACTER or LONGCHAR expression. The data type of the returned value matches the data type of the expression passed to the function.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression (a constant, field name, variable name, or expression) whose value is a CHARACTER or LONGCHAR. If expression is a case-sensitive variable, the AVM performs a case-sensitive trim. If expression is a LONGCHAR, the result is in the same code page.",
          "optional": false
        },
        {
          "name": "trim-chars",
          "type": "CHARACTER",
          "description": "A character expression that specifies the characters to be trimmed from expression. If you do not specify trim-chars, the LEFT-TRIM function removes spaces, tabs, line feeds, and carriage returns.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "LENGTH",
      "description": "Returns, as an INTEGER value, the number of characters, bytes, or columns in a string, an expression of type RAW, or a BLOB field.",
      "parameters": [
        {
          "name": "exp",
          "type": "CHARACTER",
          "description": "An expression that evaluates to a CHARACTER, LONGCHAR, INTEGER, LOGICAL, or CLOB type. If exp evaluates to an INTEGER or LOGICAL, the STRING function is used to first convert it to a character string before returning the LENGTH. For a LOGICAL, YES/TRUE returns 3 and NO/FALSE returns 2.",
          "optional": false
        },
        {
          "name": "raw-exp",
          "type": "RAW",
          "description": "A function or variable name that returns a RAW value.",
          "optional": false
        },
        {
          "name": "blob-field",
          "type": "CHARACTER",
          "description": "An expression that evaluates to a BLOB field.",
          "optional": false
        },
        {
          "name": "type",
          "type": "CHARACTER",
          "description": "A character expression that indicates whether you want the length of exp in character units, bytes, or columns. A double-byte character registers as one character unit. By default, the unit of measurement is character units.There are three valid types: \"CHARACTER,\" \"RAW,\" and \"COLUMN.\" The expression \"CHARACTER\" indicates that the length is measured in characters, including double-byte characters. The expression \"RAW\" indicates that the length is measured in bytes. The expression \"COLUMN\" indicates that the length is measured in display or print character-columns. If you specify the type as a constant expression, ABL validates the type specification at compile time. If you specify the type as a non-constant expression, the AVM validates the type specification at run time. Note: The expression \"COLUMN\" is not valid for a LONGCHAR variable or a CLOB field.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "LIBRARY",
      "description": "Parses a character string in the form path-name<<member-name>>, where path-name is the pathname of an ABL r-code library and member-name is the name of a file within the library, and returns the pathname of the library. The double angle brackets indicate that member-name is a file in a library. If the string is not in this form, the LIBRARY function returns the Unknown value (?).",
      "parameters": [
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "A character expression whose value is the pathname of a file in a library. In Windows, the pahtname cannot contain characters outside of the non-Unicode code page. See Internationalize ABL Applications for more information about Unicode and code pages.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "LINE-COUNTER",
      "description": "Returns the current line number of paged output as an INTEGER value.",
      "parameters": [
        {
          "name": "stream",
          "type": "CHARACTER",
          "description": "Specifies the name of a stream. If you do not name a stream, the AVM uses the unnamed stream. For more information on streams, see this book's DEFINE STREAM statement reference entry and OpenEdge Programming Interfaces.",
          "optional": false
        },
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "Specifies the handle to a stream. If handle it is not a valid handle to a stream, the AVM generates a run-time error. Note that stream handles are not valid for the unnamed streams. See the topics on alternate I/O sources in OpenEdge Programming Interfaces for more information on streams and stream handles.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "LIST-EVENTS",
      "description": "Returns a comma-separated list of the valid events for a specified object or widget.",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "A handle to a valid object or widget. The function returns a list of the events that are valid for that object or widget.",
          "optional": false
        },
        {
          "name": "platform",
          "type": "CHARACTER",
          "description": "A character-string value that specifies a display type. Valid values are GUI and TTY. Some events are valid only on certain platforms. If you omit the platform parameter, the AVM uses the platform for the current session.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "LIST-QUERY-ATTRS",
      "description": "Returns a comma-separated list of attributes and methods that are supported for an object or widget.",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "A handle to a valid object or widget. The function returns a list of the attributes and methods that are supported for that object or widget.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "LIST-SET-ATTRS",
      "description": "Returns a comma-separated list of attributes that can be set for an object or widget.",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "A handle to a valid object or widget. The function returns a list of the attributes that can be set for that object or widget.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "LIST-WIDGETS",
      "description": "Returns a comma-separated list of objects and widget types that respond to a specified event.",
      "parameters": [
        {
          "name": "event-name",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to an event name.",
          "optional": false
        },
        {
          "name": "platform",
          "type": "CHARACTER",
          "description": "A character-string value that specifies a display type. Valid values are GUI and TTY. Some events are valid only on certain platforms. If you omit the platform parameter, the AVM uses the platform for the current session.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "LOCKED",
      "description": "Returns a TRUE value in the following cases:",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of a record or buffer. To use the LOCKED function with a record in a table defined for multiple databases, you must qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "LOG",
      "description": "Calculates the logarithm of an expression using a specified base and returns that logarithm as a DECIMAL value.",
      "parameters": [
        {
          "name": "expression",
          "type": "DECIMAL",
          "description": "A decimal expression that you want the logarithm of.",
          "optional": false
        },
        {
          "name": "base",
          "type": "INTEGER",
          "description": "A numeric expression that is the base you want to use. If you do not specify a base, LOG returns the natural logarithm, base (e). The base must be greater than 1.",
          "optional": true
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "LOGICAL",
      "description": "Converts any data type into the LOGICAL data type.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression in the data type that you want to convert to logical.",
          "optional": false
        },
        {
          "name": "char-expression-format",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a valid logical format, such as \"si/no\", or \"da/nyet\". This argument is ignored unless expression is of CHARACTER type. Also, this argument is only needed if expression evaluates to something other than the usual TRUE or FALSE, or YES or NO values.",
          "optional": true
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "LOOKUP",
      "description": "Returns an INTEGER value giving the position of an expression in a list. Returns a 0 if the expression is not in the list.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that results in a character value that you want to look up within a list of character expressions. If the value of expression is the Unknown value (?), the result of the LOOKUP function is the Unknown value (?).",
          "optional": false
        },
        {
          "name": "list",
          "type": "CHARACTER",
          "description": "A character expression that contains the expression you name with the expression argument. Each entry in the list is separated with a delimiter. The list can be a variable of type CHARACTER or LONGCHAR. If list contains the Unknown value (?), LOOKUP returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "character",
          "type": "CHARACTER",
          "description": "A delimiter you define for the list. The default is a comma. This allows the LOOKUP function to operate on non-comma-separated lists.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "MAXIMUM",
      "description": "Compares two or more values and returns the largest value.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression. If there is a mixture of decimal and integer data types, decimal type is returned.",
          "optional": true
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "MD5-DIGEST",
      "description": "Hashes the specified data using the RSA Message Digest Hash Algorithm (MD5), and returns a 16-byte binary message digest value as a RAW value.",
      "parameters": [
        {
          "name": "data-to-hash",
          "type": "CHARACTER",
          "description": "The source data to hash. The data may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the data is a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings). To avoid this automatic conversion, specify a RAW or MEMPTR value.",
          "optional": false
        },
        {
          "name": "hash-key",
          "type": "CHARACTER",
          "description": "An optional key value to use in the hash operation. The key may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the key is a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings). To avoid this automatic conversion, specify a RAW or MEMPTR value. This key value is combined with the source data before the hash operation begins. If the hash-key value contains a null character, the null character is included in the hash operation.",
          "optional": true
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "MEMBER",
      "description": "Parses a reference to a member of an ABL r-code library and returns the simple member name.",
      "parameters": [
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "A character expression (a constant, field name, variable or expression that results in a character value) whose value is the pathname of a file in an r-code library.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "MESSAGE-DIGEST",
      "description": "Hashes any of several types of source data using the specified hashing algorithm, and returns a RAW message digest value whose size and security depends on the algorithm.",
      "parameters": [
        {
          "name": "hash-algorithm",
          "type": "CHARACTER",
          "description": "A character string that specifies the hashing algorithm to use to hash the data specified by data-to-hash. You can specify one of the following options, which are generally in the order of increased security and decreased performance: \"MD5\" — RSA Message Digest Hash Algorithm, which returns a 16-byte RAW binary message digest value. This is provided for backward compatibility only and should not be used in new development. \"SHA-1\" — United States Government Secure Hash Algorithm, which returns a RAW 20-byte binary message digest value. \"SHA-256\" — United States Government Secure Hash Algorithm, which returns a RAW 32-byte binary message digest value. \"SHA-512\" — United States Government Secure Hash Algorithm, which returns a RAW 64-byte binary message digest value. \"HMAC-SHA-1\" — United States Government HMAC (Hash-based Message Authentication Code) algorithm, which returns a RAW 20-byte binary message digest value. \"HMAC-SHA-256\" — United States Government HMAC (Hash-based Message Authentication Code) algorithm, which returns a RAW 32-byte binary message digest value. \"HMAC-SHA-384\" — United States Government HMAC (Hash-based Message Authentication Code) algorithm, which returns a RAW 48-byte binary message digest value. \"HMAC-SHA-512\" — United States Government HMAC (Hash-based Message Authentication Code) algorithm, which returns a RAW 64-byte binary message digest value.",
          "optional": false
        },
        {
          "name": "data-to-hash",
          "type": "CHARACTER",
          "description": "The source data to hash. The data may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the data is a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings). To avoid this automatic conversion, specify a RAW or MEMPTR value.",
          "optional": false
        },
        {
          "name": "hash-key",
          "type": "CHARACTER",
          "description": "A key value to use in the hash operation for the hashing algorithms. The key may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the key is a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings). To avoid this automatic conversion, specify a RAW or MEMPTR value. This key value is used along with the source data during the hash operation. For the HMAC algorithms, it is strongly recommended that you specify a hash key (preferably a randomly generated one). If hash-key is not specified it defaults to the empty string (\"\"). If either data-to-hash or hash-key is the Unknown value (?), then the Unknown value (?) is returned from the function. If the hash-key value contains a null character, the null character is included in the hash operation.",
          "optional": true
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "MESSAGE-LINES",
      "description": "Returns, as an INTEGER value, the number of lines in the message area at the bottom of the window.",
      "returnType": "INTEGER"
    },
    {
      "name": "MINIMUM",
      "description": "Compares two or more values and returns the smallest.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression. If there is a mixture of decimal and integer data types, decimal type is returned.",
          "optional": true
        }
      ]
    },
    {
      "name": "MONTH",
      "description": "Evaluates a date expression and returns a month INTEGER value from 1 to 12, inclusive.",
      "parameters": [
        {
          "name": "date",
          "type": "DATE",
          "description": "A date expression where you want a month value.",
          "optional": false
        },
        {
          "name": "datetime-expression",
          "type": "DATE",
          "description": "An expression that evaluates to a DATETIME or DATETIME-TZ. The MONTH function returns the month of the date part of the DATETIME or DATETIME-TZ value.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "MTIME",
      "description": "Returns an INTEGER value representing the time in milliseconds. If the MTIME function has no arguments, it returns the current number of milliseconds since midnight (similar to TIME, which returns seconds since midnight).",
      "parameters": [
        {
          "name": "datetime-expression",
          "type": "DATE",
          "description": "An expression that evaluates to a DATETIME or DATETIME-TZ. The MTIME function returns the time portion of datetime-expression in milliseconds. If datetime-expression is a DATETIME-TZ, the MTIME function returns the local time relative to the time zone of the DATETIME-TZ value. For Example, a DATETIME-TZ field, fdt, is created in London (time zone UTC+00:00) with a value of May 5, 2002 at 7:15:03.002 am. MTIME(fdt) returns 26,103,002, regardless of the session's time zone.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "NEW (classes)",
      "description": "Creates an instance of a class (object) and returns an object reference to that instance. You can use this object reference to access the PUBLIC data members, properties, and methods of the instance. For more information on object references, see the reference entry for a Class-based object reference.",
      "parameters": [
        {
          "name": "object-type-name",
          "type": "CHARACTER",
          "description": "Specifies the type name of the ABL or .NET class you want to instantiate. Specify a class type name using the syntax as described in the Type-name syntax reference entry. If object-type-name specifies a .NET object, it can be most any .NET class, with a few restrictions. For more information, see the Notes of this reference entry. The value of object-type-name is restricted to alphanumeric characters plus the symbols #, $, %, and _.If, without casting, you assign the NEW function value to a target data element, or pass the NEW function as input to a target routine parameter, object-type-name must specify one of the following classes: The same class type that is defined for the target A subclass of the class type that is defined for the target A class type that implements the interface type defined for the target If object-type-name specifies one of the following kinds of object types, ABL raises a compiler error: An interface type An abstract class type",
          "optional": false
        },
        {
          "name": "parameter",
          "type": "CHARACTER",
          "description": "Specifies zero or more parameters passed to a PUBLIC instance constructor that is defined for the class. You must provide the parameters identified by the specified constructor, matched with respect to number, data type, and mode. To invoke a constructor that is overloaded in the class, you must specify sufficient information for each parameter to disambiguate it from all other constructors in the class. Otherwise, ABL raises an error identifying the ambiguity.For information on the parameter passing syntax and disambiguating overloaded constructors, see the Parameter passing syntax reference entry. For information on defining a constructor for a class, see the CONSTRUCTOR statement reference entry.",
          "optional": true
        }
      ]
    },
    {
      "name": "NEW (record buffers)",
      "description": "Checks a record buffer and returns a TRUE value if the record in that buffer is newly created. If the record was read from the database, NEW returns a FALSE value.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of the record buffer you want to check with the NEW function.To use the NEW function with a record in a table defined for multiple databases, you must qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "NEXT-VALUE",
      "description": "Returns the next INT64 value of a static sequence, incremented by the positive or negative value defined in the Data Dictionary.",
      "parameters": [
        {
          "name": "sequence",
          "type": "CHARACTER",
          "description": "An identifier that specifies the name of a sequence defined in the Data Dictionary.",
          "optional": false
        },
        {
          "name": "logical-dbname",
          "type": "INTEGER",
          "description": "An identifier that specifies the logical name of the database in which the sequence is defined. The database must be connected. If multiple databases are connected, you can omit this parameter if you specify a sequence that is unique to one of the databases.tenant-id An integer expression that evaluates to the tenant ID of a regular tenant, including the default tenant (0). This option applies only to a multi-tenant sequence specified by sequence and is intended for access primarily by a super-tenant user. If you are a regular-tenant user and you specify tenant-id, the specified tenant must be the same as the tenant associated with the database connection identity for logical-dbname or the AVM raises a run-time error. If you are a super-tenant user and you do not specify tenant-id, the function assumes the effective tenant ID (GET-EFFECTIVE-TENANT-ID function). If the sequence specified by sequence is non-multi-tenant (a shared sequence in a multi-tenant database), and you specify tenant-id, the option is ignored.",
          "optional": true
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "NORMALIZE",
      "description": "Returns the normalized form of a character string based on the specified Unicode normalization form.",
      "parameters": [
        {
          "name": "string",
          "type": "CHARACTER",
          "description": "The source string to normalize. The value may be of type CHARACTER or LONGCHAR.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "NOT ENTERED",
      "description": "Returns a TRUE value if a frame field was not modified during the last INSERT, PROMPT-FOR, SET, or UPDATE statement.",
      "parameters": [
        {
          "name": "frame",
          "type": "CHARACTER",
          "description": "The frame name that contains the field named by the field argument. If you do not name a frame, the NOT ENTERED function starts with the current frame and searches outward until it finds the field you name with the field argument.",
          "optional": false
        },
        {
          "name": "field",
          "type": "CHARACTER",
          "description": "The name of the field or variable you are checking.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "NOW",
      "description": "Returns the current system date, time, and time zone as a DATETIME-TZ value.",
      "returnType": "DATETIME-TZ"
    },
    {
      "name": "NUM-ALIASES",
      "description": "Returns an INTEGER value that represents the number of aliases defined. The NUM-ALIASES function uses no arguments.",
      "returnType": "INTEGER"
    },
    {
      "name": "NUM-DBS",
      "description": "Takes no arguments; returns the number of connected databases as an INTEGER value.",
      "returnType": "INTEGER"
    },
    {
      "name": "NUM-ENTRIES",
      "description": "Returns the number of elements in a list of character strings as an INTEGER value.",
      "parameters": [
        {
          "name": "list",
          "type": "CHARACTER",
          "description": "A character expression containing a list of character strings separated with a character delimiter. The list can be a variable of type CHARACTER or LONGCHAR. NUM-ENTRIES returns the number of elements in the list. Specifically, NUM-ENTRIES returns the number of delimiters plus 1, and it returns 0 if list equals the empty string (\"\").",
          "optional": false
        },
        {
          "name": "character",
          "type": "CHARACTER",
          "description": "A delimiter you define for the list. The default is a comma (,). This allows functions to operate on non-comma-separated lists. If you use an alphabetic character, this delimiter is case sensitive.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "NUM-RESULTS",
      "description": "Returns, as an INTEGER value, the number of rows currently in the results list of a scrolling query. The results list is initialized when the query is opened. Depending on the query, the entire list is built immediately upon opening or it is gradually as needed.",
      "parameters": [
        {
          "name": "query-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a currently open, scrolling query. If query-name does not resolve to the name of a query, or if the query is not open or not scrolling, then the function returns the Unknown value (?).Note: Searching for a query using a handle is more efficient than a character expression. The AVM resolves a character expression at run time by searching in the current routine for a static query with that name. If not found, the AVM searches the enclosing main procedure. If still not found, the AVM searches up through the calling programs of the current routine, and their main procedures. Since a handle uniquely identifies a query, no such search is required. Use the query object handle's NUM-RESULTS attribute to avoid a run-time search.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "OPSYS",
      "description": "Identifies the operating system being used, so that a single version of a procedure can work differently under different operating systems. Returns the value of that operating system. Valid values are \"UNIX\" and \"WIN32\".",
      "returnType": "DECIMAL"
    },
    {
      "name": "OS-DRIVES",
      "description": "(Windows only)",
      "returnType": "CHARACTER"
    },
    {
      "name": "OS-ERROR",
      "description": "Returns, as an INTEGER value, an ABL error code that indicates whether an execution error occurred during the last OS-APPEND, OS-COPY, OS-CREATE-DIR, OS-DELETE, OS-RENAME or SAVE CACHE statement.",
      "returnType": "INTEGER"
    },
    {
      "name": "OS-GETENV",
      "description": "Returns a string that contains the value of the desired environment variable in the environment in which the ABL session is running.",
      "parameters": [
        {
          "name": "environment-variable",
          "type": "CHARACTER",
          "description": "The name of the environment variable whose value you want to find.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "PAGE-NUMBER",
      "description": "Returns the page number of the output destination as an INTEGER value. If the output stream is not paged, PAGE-NUMBER returns a value of 0.",
      "parameters": [
        {
          "name": "stream",
          "type": "CHARACTER",
          "description": "The name of an output stream. If you do not name a stream, PAGE-NUMBER returns the page number of the default unnamed output stream.",
          "optional": false
        },
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "The handle to an output stream. If handle it is not a valid handle to a stream, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "PAGE-SIZE",
      "description": "Returns the page size (lines per page) of an output destination as an INTEGER value. If the output stream is not paged, PAGE-SIZE returns a value of 0.",
      "parameters": [
        {
          "name": "stream",
          "type": "CHARACTER",
          "description": "The name of an output stream. If you do not name a stream, PAGE-SIZE returns the page size of the default unnamed output stream.",
          "optional": false
        },
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "The handle to an output stream. If handle it is not a valid handle to a stream, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "PDBNAME",
      "description": "Returns the physical name of a currently connected database.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "INTEGER",
          "description": "If the parameter supplied to PDBNAME is an integer expression, and there are, for example, three currently connected databases, then PDBNAME(1), PDBNAME(2), and PDBNAME(3) return their physical names. Also, continuing the same example of three connected databases, PDBNAME(4), PDBNAME(5), etc., return the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "This form of the PDBNAME function requires a quoted character string or a character expression as a parameter. If the parameter is the logical name of a connected database or an alias of a connected database, then the physical name is returned. Otherwise, it returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "PROC-HANDLE",
      "description": "Returns a value in the appropriate data type (usually INTEGER) that is a unique identifier for a stored procedure.",
      "returnType": "INTEGER"
    },
    {
      "name": "PROC-STATUS",
      "description": "Returns the return status from a stored procedure. The return status is an INTEGER value that indicates whether a stored procedure failed and why.",
      "returnType": "INTEGER"
    },
    {
      "name": "PROCESS-ARCHITECTURE",
      "description": "Identifies the bit value of the AVM process you are using at run time and returns this value as an INTEGER. Valid values are 32 for a 32-bit AVM and 64 for 64-bit AVM. For example, an application that uses a 32-bit Windows API through the DLL external procedure interface may need to pass different parameters to a function when running a 64-bit GUI client than when running a 32-bit GUI client. Using PROCESS-ARCHITECTURE, you can decide the parameters to pass.",
      "returnType": "INTEGER"
    },
    {
      "name": "PROGRAM-NAME",
      "description": "Returns the name of the calling program.",
      "parameters": [
        {
          "name": "n",
          "type": "CHARACTER",
          "description": "The numeric argument. If n is 1, the name of the current program is returned. If n is 2, the name of the calling program is returned. If there is no calling program then you have reached the top of the call stack and the AVM returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "PROGRESS",
      "description": "Returns one of the following character values which identifies the ABL product that is running: Full, Query or Run-time. Can also return COMPILE if you use the Developer's Toolkit, or COMPILE-ENCRYPT if you use the run-time Compiler.",
      "returnType": "CHARACTER"
    },
    {
      "name": "PROMSGS",
      "description": "Returns the current value of the ABL PROMSGS variable.",
      "returnType": "DECIMAL"
    },
    {
      "name": "PROPATH",
      "description": "Returns the current value of the PROPATH environment variable.",
      "returnType": "CHARACTER"
    },
    {
      "name": "PROVERSION",
      "description": "Returns the version of ABL, or release of OpenEdge, you are running. You can also optionally retrieve additional release information, such as the service pack version number and the hot fix version number.",
      "parameters": [
        {
          "name": "mode",
          "type": "INTEGER",
          "description": "An optional integer expression that identifies how much version information is returned, as follows:If the value of mode is either 0 or not specified, PROVERSION returns limited version information—the major version number, the minor version number, and, if applicable, the version tag. If the value of mode is 1, PROVERSION returns full version information—the major version number, the minor version number, the service pack number, the hot fix version number, the build number, and, if applicable, the version tag. If the value of mode is other than 1 or 0, a run-time error message is returned.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "QUERY-OFF-END",
      "description": "Returns a LOGICAL value indicating whether the specified query is positioned at the end of its result list (either before the first record or after the last record).",
      "parameters": [
        {
          "name": "query-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a currently open query. If query-name does not resolve to the name of a query, or if the query is not open, then the function returns the Unknown value (?).Note: Searching for a query using a handle is more efficient than a character expression. The AVM resolves a character expression at run time by searching in the current routine for a static query with that name. If not found, the AVM searches the enclosing main procedure. If still not found, the AVM searches up through the calling programs of the current routine, and their main procedures. Since a handle uniquely identifies a query, no such search is required. Use the query object handle's QUERY-OFF-END attribute to avoid a run-time search.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "QUOTER",
      "description": "Converts the specified data type to CHARACTER and encloses the results in quotes when necessary.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression in the data type that you want to convert to character and enclose with quotes.",
          "optional": false
        },
        {
          "name": "quote-char",
          "type": "CHARACTER",
          "description": "Either a single or double quote, enclosed in the opposite: \"'\" or '\"'. The default is double quote. Passing ? for this argument results in double quotes.",
          "optional": false
        },
        {
          "name": "null-string",
          "type": "CHARACTER",
          "description": "The string you want for an unknown value: the word NULL or \"\" for example. The default is an unquoted question mark, which is the Unknown value (?).For example, the following code: DEFINE VARIABLE mychar As CHARACTER NO-UNDO INITIAL \"Lift Line Skiing\". ... qhandle:QUERY-PREPARE(\"FOR EACH Customer WHERE Customer.Name = \" + QUOTER(mychar)) Would produce this prepare-string: FOR EACH Customer WHERE Customer.Name = \"Lift Line Skiing\".",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "R-INDEX",
      "description": "Returns an INTEGER value that indicates the position of the target string within the source string. In contrast to the INDEX function, R-INDEX performs the search from right to left.",
      "parameters": [
        {
          "name": "source",
          "type": "CHARACTER",
          "description": "A constant, field name, variable name, or expression that results in a CHARACTER or LONGCHAR value.",
          "optional": false
        },
        {
          "name": "target",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression whose position you want to locate in source. If target does not exist within source, R-INDEX returns 0.If a starting parameter is not specified, then the search for the target pattern begins at the right-most character. Even though the search is started from the right, the target position is calculated from the left. For example, this code returns a 3 rather than a 2: R-INDEX(\"abcd\" , \"c\")",
          "optional": false
        },
        {
          "name": "starting",
          "type": "INTEGER",
          "description": "An integer that specifies the begin point for the search. The search is right-to-left and starts from the starting point. For example, this statement returns 1 R-INDEX(\"abcdefabcdef\",\"abc\",6).",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "RANDOM",
      "description": "Returns a random INTEGER value between two integers (inclusive).",
      "parameters": [
        {
          "name": "low",
          "type": "INTEGER",
          "description": "An integer expression that is the lower of the two expressions you are supplying to the RANDOM function. This can be an INT64 value.",
          "optional": false
        },
        {
          "name": "high",
          "type": "INTEGER",
          "description": "An integer expression that is the higher of the two expressions you are supplying to the RANDOM function. This can be an INT64 value.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "RAW",
      "description": "(ORACLE only)",
      "parameters": [
        {
          "name": "field",
          "type": "CHARACTER",
          "description": "Any field from which you want to extract bytes.",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer expression that indicates the position of the first byte you want to extract from field. The default value of position is 1.",
          "optional": false
        },
        {
          "name": "length",
          "type": "INTEGER",
          "description": "An integer expression that indicates the number of bytes you want to extract from field. If you do not use the length argument, RAW uses field from position to end.",
          "optional": true
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "RECID",
      "description": "Returns the unique internal identifier of the database record currently associated with the record buffer you name. This internal identifier has the data type RECID, a four-byte value that is supported by OpenEdge databases and some non-OpenEdge DataServers.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of the record whose RECID you want.To use the RECID function with a record in a table defined for multiple databases, you must qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        }
      ],
      "returnType": "RECID"
    },
    {
      "name": "RECORD-LENGTH",
      "description": "Returns the length of a record in a buffer as an INTEGER value.",
      "parameters": [
        {
          "name": "buffer",
          "type": "CHARACTER",
          "description": "A database buffer containing a record.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "REJECTED",
      "description": "Returns the current REJECTED attribute setting for a ProDataSet temp-table buffer.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "The name of a ProDataSet temp-table buffer.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "REPLACE",
      "description": "Returns a string with specified substring replacements. The data type of the returned value matches the data type of the expression passed to the function.",
      "parameters": [
        {
          "name": "source-string",
          "type": "CHARACTER",
          "description": "Specifies the base string to make replacements in. The source-string parameter can be any expression that evaluates to a string or a LONGCHAR. The REPLACE function does not change the value of source-string itself; the function returns the string with replacements.",
          "optional": false
        },
        {
          "name": "from-string",
          "type": "CHARACTER",
          "description": "Specifies the substring to replace. The from-string parameter can be any expression that evaluates to a string or a LONGCHAR. Each occurrence of from-string within source-string is replaced.",
          "optional": false
        },
        {
          "name": "to-string",
          "type": "CHARACTER",
          "description": "Specifies the replacement substring. The to-string parameter can be any expression that evaluates to a string or a LONGCHAR. Each occurrence of from-string in source-string is replaced by to-string.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "RETRY",
      "description": "Returns a TRUE value if the current block is being reprocessed after a previous UNDO, RETRY.",
      "returnType": "LOGICAL"
    },
    {
      "name": "RETURN-VALUE",
      "description": "Provides a character string value returned by the most recently executed RETURN statement of a local or remote procedure, trigger block, user-defined function, method of a class, class constructor, or property accessor.",
      "returnType": "CHARACTER"
    },
    {
      "name": "RGB-VALUE",
      "description": "Returns an INTEGER value that represents a combination of a red, green, and blue color value. This function allows you to define an arbitrary color, expanding beyond those colors defined in the color table.",
      "parameters": [
        {
          "name": "redval",
          "type": "INTEGER",
          "description": "Identifies red, green, and blue color values which can be combined to define a unique color value.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "RIGHT-TRIM",
      "description": "Removes trailing white space, or other specified characters, from a CHARACTER or LONGCHAR expression. The data type of the returned value matches the data type of the expression passed to the function.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression (a constant, field name, variable name, or expression) whose value is a CHARACTER or LONGCHAR. If expression is a case-sensitive variable, the AVM performs a case-sensitive trim. If expression is a LONGCHAR, the result is in the same code page.",
          "optional": false
        },
        {
          "name": "trim-chars",
          "type": "CHARACTER",
          "description": "A character expression that specifies the characters to trim from expression. If you do not specify trim-chars, the RIGHT-TRIM function removes spaces, tabs, line feeds, and carriage returns.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "ROUND",
      "description": "Rounds a decimal expression to a specified number of places after the decimal point.",
      "parameters": [
        {
          "name": "expression",
          "type": "DECIMAL",
          "description": "A decimal expression.",
          "optional": false
        },
        {
          "name": "precision",
          "type": "INTEGER",
          "description": "A non-negative integer expression whose value is the number of places you want in the decimal result of the ROUND function.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "ROW-STATE",
      "description": "Returns an INTEGER value that represents the current change state of a static ProDataSet temp-table buffer.",
      "parameters": [
        {
          "name": "buffer-name",
          "type": "CHARACTER",
          "description": "The name of a ProDataSet temp-table buffer (preferably a before-image temp-table buffer).",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "ROWID",
      "description": "Returns the unique internal identifier of the database record currently associated with the record buffer you name. This internal identifier has the data type ROWID, which is supported for OpenEdge and all other DataServer databases.",
      "parameters": [
        {
          "name": "record",
          "type": "CHARACTER",
          "description": "The name of the record whose ROWID you want.To use the ROWID function with a record in a table defined for multiple databases, you must qualify the record's table name with the database name. See the record definition in the Record phrase reference entry for more information.",
          "optional": false
        }
      ],
      "returnType": "ROWID"
    },
    {
      "name": "SCREEN-LINES",
      "description": "Returns, as an INTEGER value, the number of lines you can use to display frames. This value omits the space used by the message area and status area.",
      "returnType": "INTEGER"
    },
    {
      "name": "SDBNAME",
      "description": "Accepts an integer expression or a character expression as a parameter. If the parameter resolves to a currently connected non-OpenEdge database then the SDBNAME function returns the logical name of the schema holder database containing the non-OpenEdge schema. If the parameter resolves to a currently connected OpenEdge database, the SDBNAME function returns the logical name of this database.",
      "parameters": [
        {
          "name": "integer-expression",
          "type": "INTEGER",
          "description": "If the parameter supplied to SDBNAME is an integer expression, and there are, for example, three connected databases, then SDBNAME(1), SDBNAME(2), and SDBNAME(3) return the logical names of their respective schema holder databases. Also, if there are three connected databases, SDBNAME(4), SDBNAME(5), etc., return the Unknown value (?).",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "These forms of the SDBNAME function require a quoted character string or a character expression as a parameter. If the parameter is the logical name of a connected database or an alias of a connected database, then the logical name of the schema holder database is returned according to the rule. Otherwise, SDBNAME returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "SEARCH",
      "description": "Searches the directories and libraries defined in the PROPATH environment variable for a file. The SEARCH function returns the full pathname of the file unless it is found in your current working directory. If SEARCH does not find the file, it returns the Unknown value (?).",
      "parameters": [
        {
          "name": "opsys-file",
          "type": "CHARACTER",
          "description": "A character expression whose value is the name of the file you want to find. The name can include a complete or partial directory path. If opsys-file is a constant string, you must enclose it in quotation marks (\" \"). The value of opsys-file must be no more than 255 characters long. The filename can contain Unicode characters. See Internationalize ABL Applications for more information about Unicode.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "SEEK",
      "description": "Returns the offset of the file pointer in a text file as an INT64 value. You define a procedure variable to hold the offset value and later position the file to that offset.",
      "parameters": [
        {
          "name": "name",
          "type": "CHARACTER",
          "description": "If you specify SEEK (name), the SEEK function returns the current position of the file pointer in the named input or output stream. The stream must be associated with an open file, or SEEK returns the Unknown value (?).",
          "optional": false
        },
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "If you specify the handle to a stream, the SEEK function returns the current position of the file pointer in the stream. If handle it is not a valid handle to a stream, the AVM generates a run-time error.",
          "optional": false
        }
      ],
      "returnType": "INT64"
    },
    {
      "name": "SET-DB-CLIENT",
      "description": "Sets the user identity for a specified connected OpenEdge database using an unsealed or a sealed client-principal object.",
      "parameters": [
        {
          "name": "client-principal-handle",
          "type": "HANDLE",
          "description": "A handle to a client-principal object. If the client-principal object is unsealed, it must be initialized with the attribute values required by the SEAL( ) method in addition to any PRIMARY-PASSPHRASE attribute value required to authenticate the asserted user identity. If the object is sealed, it must be sealed with a domain access code that is the same as the access code configured for the user's domain stored in the domain registry trusted by the specified database connection. If this parameter is set to the Unknown value (?), the current identity of affected database connections remains unchanged, and the function unlocks and allows the connection identity to be set using the SET-CLIENT( ) method, as described for the setting of database parameters.",
          "optional": false
        },
        {
          "name": "integer-expression",
          "type": "CHARACTER",
          "description": "Specifies a database connection on which to set the identity as follows: integer-expression The sequence number of a connected OpenEdge database for which to set the user identity. For example, SET-DB-CLIENT(hCP, 1) sets the user identity associated with the specified client-principal object for the first database connection, SET-DB-CLIENT(hCP, 2) sets the user identity for the second database connection, and so on. If you specify a sequence number that does not correspond to a connected database, the function returns FALSE. logical-name | alias The logical name or alias of a connected OpenEdge database for which to set the user identity. These forms require a quoted character string or a character expression. If you specify a logical name or alias that does not correspond to a connected database, the function returns FALSE. If you pass a valid option to identify an OpenEdge database connection, the function operates on that OpenEdge database connection as follows: If the LOGIN-STATE attribute on the client-principal object is set to \"INITIAL\", the function performs a user authentication operation, and if successful, sets user identity for the database connection, If the LOGIN-STATE attribute on the client-principal object is set to \"LOGIN\", the function performs a validation (SSO) of the user identity, and if successful, sets the user identity for the database connection. If client-principal-handle is the Unknown value (?), the current connection identity remains unchanged, and the function removes the SECURITY-POLICY:SET-CLIENT( ) method lockout on the database connection. If you do not pass an option to identify the specific database connection or you specify the Unknown value (?), the function operates on all OpenEdge database connections as follows: If the LOGIN-STATE attribute on the client-principal object is set to \"INITIAL\", the function performs a user authentication operation for the first OpenEdge database connection, and if the authentication is successful, the function: Sets that database connection's user identity. With the client-principal LOGIN-STATE attribute set to \"LOGIN\", performs an SSO operation to validate and (if successful) set the user identity for each remaining OpenEdge database connection in the ABL session. If the LOGIN-STATE attribute on the client-principal object is set to \"LOGIN\", the function performs an SSO operation to validate and (if successful) set the user identity for each OpenEdge database connection in the ABL session. If client-principal-handle is the Unknown value (?), the current identity remains unchanged for all OpenEdge databases connections, and the function removes the SECURITY-POLICY:SET-CLIENT( ) method lockout on all the connections.",
          "optional": false
        },
        {
          "name": "integer-expression",
          "type": "LOGICAL",
          "description": "The sequence number of a connected OpenEdge database for which to set the user identity. For example, SET-DB-CLIENT(hCP, 1) sets the user identity associated with the specified client-principal object for the first database connection, SET-DB-CLIENT(hCP, 2) sets the user identity for the second database connection, and so on. If you specify a sequence number that does not correspond to a connected database, the function returns FALSE.",
          "optional": false
        },
        {
          "name": "logical-name",
          "type": "CHARACTER",
          "description": "The logical name or alias of a connected OpenEdge database for which to set the user identity. These forms require a quoted character string or a character expression. If you specify a logical name or alias that does not correspond to a connected database, the function returns FALSE.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "SET-EFFECTIVE-TENANT",
      "description": "Sets the effective tenancy of a multi-tenant database connection for a super-tenant user. A super tenant has no real tenancy of its own, but can act as if it is a particular regular tenant without the user having to authenticate a new connection identity that has that particular tenancy. Therefore, the effective tenancy is the acting regular tenancy of a super tenant.",
      "parameters": [
        {
          "name": "tenant-expression",
          "type": "CHARACTER",
          "description": "An integer or character string expression. If tenant-expression evaluates to an integer, the value must be a valid tenant ID for a regular or default tenant. If tenant-expression evaluates to a character string, the value must be a valid tenant name for a regular or default tenant. Otherwise, the statement raises ERROR.",
          "optional": false
        },
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "SETUSERID",
      "description": "Authenticates a user identity for a specified database connection, verifying that the user ID and password supplied to the SETUSERID function match a user account in the _User table of the database. (This restriction does not apply to authentication with an STS-enabled database. See notes below for more information.) If they match, the database connection is set to the specified user identity and the function returns a TRUE value. If the database is multi-tenant, is also sets the user's tenancy.",
      "parameters": [
        {
          "name": "userid",
          "type": "CHARACTER",
          "description": "A literal value, field name, variable name, or expression that results in a character value that represents the user's user ID. If you use a literal value, you must enclose it in quotation marks (\"\"). If the user is defined in a non-default domain, this value must be a fully qualified user ID, including both the non-qualified user ID and domain separated by a domain delimiter (@). If the user is defined in the default (blank) domain, only a non-qualified user ID (without a domain delimiter) must be specified. For more information on specifying a fully qualified user ID, see the reference entry for the QUALIFIED-USER-ID attribute. Note: The default blank domain provides backward compatibility with OpenEdge releases that do not support domains as part of a user's identity.",
          "optional": false
        },
        {
          "name": "password",
          "type": "CHARACTER",
          "description": "A literal value, field name, variable name, or other character expression that results in a character value that represents the user's password. If you use a literal value, you must enclose it in quotation marks (\"\"). Alternatively, you can encrypt the password using the ENCRYPT-AUDIT-MAC-KEY( ) method. For more information, see the topics on encrypted passwords in OpenEdge Programming Interfaces.",
          "optional": false
        },
        {
          "name": "logical-dbname",
          "type": "CHARACTER",
          "description": "The logical name of the database on whose connection you want to check and set the user identity. The logical database name must be a character string enclosed in quotes, or a character expression. If you do not specify this argument, the compiler inserts the name of the database that is connected when the procedure is compiled. If you omit this argument and more than one database is connected, ABL raises an error.",
          "optional": true
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "SHA1-DIGEST",
      "description": "Hashes the specified data using the United States Government Secure Hash Algorithm (SHA-1), and returns a 20-byte binary message digest value as a RAW value.",
      "parameters": [
        {
          "name": "data-to-hash",
          "type": "CHARACTER",
          "description": "The source data to hash. The data may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the data is a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings). To avoid this automatic conversion, specify a RAW or MEMPTR value.",
          "optional": false
        },
        {
          "name": "hash-key",
          "type": "CHARACTER",
          "description": "An optional key value to use in the hash operation. The key may be of type CHARACTER, LONGCHAR, RAW, or MEMPTR. If the key is a CHARACTER or LONGCHAR value, the AVM converts it to UTF-8 (which ensures a consistent value regardless of code page settings). To avoid this automatic conversion, specify a RAW or MEMPTR value. This key value is combined with the source data before the hash operation begins. If the hash-key value contains a null character, the null character is included in the hash operation.",
          "optional": true
        }
      ],
      "returnType": "RAW"
    },
    {
      "name": "SQRT",
      "description": "Returns the square root (as a DECIMAL value) of an expression you specify.",
      "parameters": [
        {
          "name": "expression",
          "type": "INTEGER",
          "description": "A numeric expression. If the value of the expression is negative, SQRT returns the Unknown value (?).",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "SSL-SERVER-NAME",
      "description": "Returns the digital certificate subject name for an OpenEdge database connected via SSL. If a database connection does not exist or the connection is not using SSL, this function returns the Unknown value (?).",
      "parameters": [
        {
          "name": "logical-database-name",
          "type": "CHARACTER",
          "description": "A quoted character string or character expression that specifies the database by its logical name.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "STRING",
      "description": "Converts a value of any data type into a character value.",
      "parameters": [
        {
          "name": "source",
          "type": "CHARACTER",
          "description": "An expression of any data type that you want to convert to a character value.",
          "optional": false
        },
        {
          "name": "format",
          "type": "CHARACTER",
          "description": "The format you want to use for the new character value. This format must be appropriate to the data type of source. If you do not use this argument, ABL uses the EXPORT format for all data types (except DATETIME and DATETIME-TZ, in which case it uses the default display format). This is useful if you want to produce left-justified numbers. For information on data display formats, see ABL Essentials.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "SUBSTITUTE",
      "description": "Returns a character string that is made up of a base string plus the substitution of arguments in the string. It allows you to use a single string in place of concatenated strings. The function is designed to simplify the task of translating an application from one language to another and is similar to the sprintf function in the C programming language. The data type returned reflects the data type used in its input parameter. For example, if the input parameter is a LONGCHAR, then the function returns a LONGCHAR; if the input parameter is a CHARACTER, then the function returns a CHARACTER.",
      "parameters": [
        {
          "name": "base-string",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR variable optionally containing substitution parameters of the form &n, where n is an integer between 1 and 9, inclusive.",
          "optional": false
        },
        {
          "name": "arg",
          "type": "CHARACTER",
          "description": "A constant, field name, variable, or expression that results in a CHARACTER or LONGCHAR value. These argument values replace substitution parameters in base-string.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "SUBSTRING",
      "description": "Extracts a portion of a character string from a field or variable.",
      "parameters": [
        {
          "name": "source",
          "type": "CHARACTER",
          "description": "A CHARACTER or LONGCHAR expression from which you want to extract characters or bytes.",
          "optional": false
        },
        {
          "name": "position",
          "type": "INTEGER",
          "description": "An integer expression that indicates the position of the first character you want to extract from source.",
          "optional": false
        },
        {
          "name": "length",
          "type": "INTEGER",
          "description": "An integer expression that indicates the number of characters you want to extract from source. If you do not use the length argument or specify -1 as the length, SUBSTRING uses the remainder of the string from the specified position.",
          "optional": false
        },
        {
          "name": "type",
          "type": "CHARACTER",
          "description": "A CHARACTER expression that directs ABL to interpret the specified position and length values as character units, bytes, or columns. A double-byte character registers as one character unit. By default, ABL interprets the specified position and length values as character units. There are four valid types: \"CHARACTER,\" \"FIXED,\" \"COLUMN,\" and \"RAW.\" The expression \"CHARACTER\" specifies character units. The expression \"FIXED\" specifies that position is in character units and the length is in bytes, but directs SUBSTRING to yield only whole characters. That is, if the last byte or bytes represent part of, but not all of, a multi-byte character, these bytes are excluded. The expression \"COLUMN\" specifies display or print character-columns. The expression \"RAW\" specifies bytes. If you specify the type as a constant expression, ABL validates the type specification at compile time. If you specify the type as a non-constant expression, the AVM validates the type specification at run time. Note: If source is a LONGCHAR expression, \"CHARACTER\" is the only valid type and the default type.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "SUPER",
      "description": "Runs the super procedure version of the current user-defined function.",
      "parameters": [
        {
          "name": "parameter",
          "type": "CHARACTER",
          "description": "A parameter of the super version of the current user-defined function. These parameters must have the same signature (number of parameters, and type and mode of each) as the parameters of the current user-defined function. You can, however, adjust a parameter's value. For the parameter syntax, see the Parameter definition syntax reference entry. If a user-defined function cannot be located in any super procedure, the AVM generates the following error message: SUPER version of user-defined function name invoked but could not be found Errors are stored in the ERROR-STATUS handle when NO-ERROR is specified.",
          "optional": true
        }
      ]
    },
    {
      "name": "TENANT-ID",
      "description": "Returns the tenant ID (as an integer) of the real tenant associated with a database connection.",
      "parameters": [
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If the database is not enabled for multi-tenancy, the function returns zero (0). If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "TENANT-NAME",
      "description": "Returns the name (as a character string) of the real tenant associated with a database connection.",
      "parameters": [
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If the database is not enabled for multi-tenancy, the function returns the empty string (\"\"). If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "TENANT-NAME-TO-ID",
      "description": "Returns the tenant ID associated with an input tenant name.",
      "parameters": [
        {
          "name": "tenant-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to the name of a tenant.",
          "optional": false
        },
        {
          "name": "database-name",
          "type": "CHARACTER",
          "description": "A character expression that evaluates to a logical database name or database alias. If no database is specified and more than one database is connected, the AVM raises an error. If the database name is not a valid name for a connected database, the AVM raises an error.",
          "optional": true
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "TERMINAL",
      "description": "In Windows, in graphical interfaces, TERMINAL returns WIN3. In Windows, in character interfaces, TERMINAL returns CO80, BW80, or MONO, depending on the monitor type. On UNIX, TERMINAL returns the value of the $TERM environment variable. In batch mode, TERMINAL returns a null string."
    },
    {
      "name": "TIME",
      "description": "Returns an INTEGER value representing the time as the number of seconds since midnight. Use this function together with the STRING function to produce the time in hours, minutes, and seconds.",
      "returnType": "INTEGER"
    },
    {
      "name": "TIMEZONE",
      "description": "Returns an INTEGER value representing the time zone offset from Coordinated Universal Time (UTC), in minutes. Use this function together with the STRING function to produce the time in hours, minutes, and seconds.",
      "parameters": [
        {
          "name": "datetime-tz-expression",
          "type": "DATE",
          "description": "An expression whose value is a DATETIME-TZ.",
          "optional": false
        },
        {
          "name": "char-expression",
          "type": "CHARACTER",
          "description": "A character expression representing the time zone offset. The format of the expression must be +HH:MM. If the TIMEZONE function has no arguments, it returns the client or server machine that serves as the time source for applications running during the ABL session (specified by the TIME-SOURCE attribute).",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "TODAY",
      "description": "Returns the current system date.",
      "returnType": "DATE"
    },
    {
      "name": "TO-ROWID",
      "description": "Converts a string representation of a ROWID to a valid ROWID value.",
      "parameters": [
        {
          "name": "rowid-string",
          "type": "CHARACTER",
          "description": "A string representation of a ROWID. Since ROWID values are a variable sequence of hexadecimal digits, rowid-string must be in the form \"0xhex-digits\", where hex-digits is any string of characters from 0 through 9 and A through F.",
          "optional": false
        }
      ],
      "returnType": "ROWID"
    },
    {
      "name": "TRANSACTION",
      "description": "Returns a LOGICAL value that indicates whether a transaction is currently active.",
      "returnType": "LOGICAL"
    },
    {
      "name": "TRIM",
      "description": "Removes leading and trailing white space, or other specified characters, from a CHARACTER or LONGCHAR expression. The data type of the returned value matches the data type of the expression passed to the function.",
      "parameters": [
        {
          "name": "expression",
          "type": "CHARACTER",
          "description": "An expression (a constant, field name, variable name, or expression) whose value is a CHARACTER or LONGCHAR. If expression is a case-sensitive variable, the AVM performs a case-sensitive trim. If expression is a LONGCHAR, the result is in the same code page.",
          "optional": false
        },
        {
          "name": "trim-chars",
          "type": "CHARACTER",
          "description": "A character expression that specifies the characters to trim from expression. If you do not specify trim-chars, the TRIM function removes spaces, tabs, line feeds, and carriage returns.",
          "optional": true
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "TRUNCATE",
      "description": "Truncates a decimal expression to a specified number of decimal places, returning a decimal value.",
      "parameters": [
        {
          "name": "expression",
          "type": "DECIMAL",
          "description": "A decimal expression that you want to truncate.",
          "optional": false
        },
        {
          "name": "decimal-places",
          "type": "INTEGER",
          "description": "A non-negative integer expression that indicates the number of decimal places for a truncated expression.",
          "optional": false
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "TYPE-OF",
      "description": "Verifies that the class instance to which the specified object reference points is an instance of the specified object type, inherits from the specified super class, or implements the specified interface. If the object reference points to an instance of the specified type, the function returns TRUE. Otherwise, it returns FALSE.",
      "returnType": "LOGICAL"
    },
    {
      "name": "UNBOX",
      "description": "(Windows only; GUI for .NET only)",
      "parameters": [
        {
          "name": "object-reference",
          "type": "CHARACTER",
          "description": "Specifies an object reference to a boxed .NET primitive value (System.Object) or to a one-dimensional .NET array object. For a list of the .NET primitive types that a System.Object can box, see Table 4. If object-reference points to a boxed .NET primitive value, the function returns a value of the ABL primitive type that implicitly maps to the boxed .NET type. If object-reference points to a one-dimensional .NET array object, the function returns a copy of the elements contained by the .NET array as an ABL array. If these elements are .NET mapped object types, the returned ABL array contains elements of the corresponding ABL primitive type. Otherwise, the ABL array contains object reference elements of the actual object type contained by the input .NET array.",
          "optional": false
        }
      ]
    },
    {
      "name": "USERID",
      "description": "Returns a character string representing the user ID for the specified database connection identity.",
      "parameters": [
        {
          "name": "logical-dbname",
          "type": "CHARACTER",
          "description": "The logical name of the database from whose connection identity you want to retrieve the user ID. The logical database name must be a character string enclosed in quotes, or a character expression. If you do not specify this argument, the compiler inserts the name of the database that is connected when the procedure is compiled. If you omit this argument and more than one database is connected, ABL raises an error.",
          "optional": false
        }
      ],
      "returnType": "CHARACTER"
    },
    {
      "name": "VALID-EVENT",
      "description": "Verifies whether a specified event is valid for a specified widget. For each type of widget, only certain events are valid. The function returns a value (TRUE/FALSE).",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "An expression that produces a value of type HANDLE. The value must be the handle of a valid widget.",
          "optional": false
        },
        {
          "name": "event-name",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of an event.",
          "optional": false
        },
        {
          "name": "platform",
          "type": "CHARACTER",
          "description": "A character-string expression that evaluates to the name of a platform type: GUI or TTY.",
          "optional": true
        }
      ],
      "returnType": "DECIMAL"
    },
    {
      "name": "VALID-HANDLE",
      "description": "Verifies that a handle is valid.",
      "parameters": [
        {
          "name": "handle",
          "type": "CHARACTER",
          "description": "An expression that evaluates to a value of type HANDLE. If the handle represents an object that is currently valid, VALID-HANDLE returns TRUE. If the handle is no longer valid (if, for example, some procedure deleted the object), the function returns FALSE.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "VALID-OBJECT",
      "description": "Verifies that an object reference points to a valid ABL or .NET class-based object instance or an ABL handle-based object. If the object reference represents an object that is currently valid, the function returns TRUE. If the object reference is no longer valid (for example, it was garbage collected or explicitly deleted), the function returns FALSE.",
      "parameters": [
        {
          "name": "handle",
          "type": "HANDLE",
          "description": "A handle to an ABL handle-based object. The handle argument must be a variable of type HANDLE and must contain a valid handle. When used with a handle-based object, VALID-OBJECT works in the same way as the VALID-HANDLE function.",
          "optional": false
        },
        {
          "name": "object-reference",
          "type": "CHARACTER",
          "description": "An object reference defined for an ABL or .NET object type. For more information, see the Class-based object reference reference entry.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "WEEKDAY",
      "description": "Evaluates a date expression and returns the day of the week as an INTEGER value from 1 (Sunday) to 7 (Saturday) for that date.",
      "parameters": [
        {
          "name": "date",
          "type": "DATE",
          "description": "A date expression for which you want the day of the week.",
          "optional": false
        },
        {
          "name": "datetime-expression",
          "type": "DATE",
          "description": "An expression that evaluates to a DATETIME or DATETIME-TZ. The WEEKDAY function returns the weekday of the date part of the DATETIME or DATETIME-TZ value.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    },
    {
      "name": "WIDGET-HANDLE",
      "description": "This function is supported only for backward compatibility. Use the HANDLE function instead.",
      "parameters": [
        {
          "name": "handle-string",
          "type": "HANDLE",
          "description": "A string representation of a handle. Since handles are integer values, the string must contain only numeric characters.",
          "optional": false
        }
      ],
      "returnType": "LOGICAL"
    },
    {
      "name": "YEAR",
      "description": "Evaluates a date expression and returns the year value of that date, including the century, as an INTEGER value.",
      "parameters": [
        {
          "name": "date",
          "type": "DATE",
          "description": "A date expression for which you want to determine the year.",
          "optional": false
        },
        {
          "name": "datetime-expression",
          "type": "DATE",
          "description": "An expression that evaluates to a DATETIME or DATETIME-TZ. The YEAR function returns the year of the date part of the DATETIME or DATETIME-TZ value.",
          "optional": false
        }
      ],
      "returnType": "INTEGER"
    }
  ]
}